GopalSaraf/Practicals/PSDL/include/proc/pic18f86j99.inc
// Register: RPOR44_45
#define RPOR44_45 RPOR44_45
RPOR44_45                                equ 0E28h
// bitfield definitions
RPOR44_45_RPO44R_POSN                    equ 0000h
RPOR44_45_RPO44R_POSITION                equ 0000h
RPOR44_45_RPO44R_SIZE                    equ 0004h
RPOR44_45_RPO44R_LENGTH                  equ 0004h
RPOR44_45_RPO44R_MASK                    equ 000Fh
RPOR44_45_RPO45R_POSN                    equ 0004h
RPOR44_45_RPO45R_POSITION                equ 0004h
RPOR44_45_RPO45R_SIZE                    equ 0004h
RPOR44_45_RPO45R_LENGTH                  equ 0004h
RPOR44_45_RPO45R_MASK                    equ 00F0h
RPOR44_45_RPO44R0_POSN                   equ 0000h
RPOR44_45_RPO44R0_POSITION               equ 0000h
RPOR44_45_RPO44R0_SIZE                   equ 0001h
RPOR44_45_RPO44R0_LENGTH                 equ 0001h
RPOR44_45_RPO44R0_MASK                   equ 0001h
RPOR44_45_RPO44R1_POSN                   equ 0001h
RPOR44_45_RPO44R1_POSITION               equ 0001h
RPOR44_45_RPO44R1_SIZE                   equ 0001h
RPOR44_45_RPO44R1_LENGTH                 equ 0001h
RPOR44_45_RPO44R1_MASK                   equ 0002h
RPOR44_45_RPO44R2_POSN                   equ 0002h
RPOR44_45_RPO44R2_POSITION               equ 0002h
RPOR44_45_RPO44R2_SIZE                   equ 0001h
RPOR44_45_RPO44R2_LENGTH                 equ 0001h
RPOR44_45_RPO44R2_MASK                   equ 0004h
RPOR44_45_RPO44R3_POSN                   equ 0003h
RPOR44_45_RPO44R3_POSITION               equ 0003h
RPOR44_45_RPO44R3_SIZE                   equ 0001h
RPOR44_45_RPO44R3_LENGTH                 equ 0001h
RPOR44_45_RPO44R3_MASK                   equ 0008h
RPOR44_45_RPO45R0_POSN                   equ 0004h
RPOR44_45_RPO45R0_POSITION               equ 0004h
RPOR44_45_RPO45R0_SIZE                   equ 0001h
RPOR44_45_RPO45R0_LENGTH                 equ 0001h
RPOR44_45_RPO45R0_MASK                   equ 0010h
RPOR44_45_RPO45R1_POSN                   equ 0005h
RPOR44_45_RPO45R1_POSITION               equ 0005h
RPOR44_45_RPO45R1_SIZE                   equ 0001h
RPOR44_45_RPO45R1_LENGTH                 equ 0001h
RPOR44_45_RPO45R1_MASK                   equ 0020h
RPOR44_45_RPO45R2_POSN                   equ 0006h
RPOR44_45_RPO45R2_POSITION               equ 0006h
RPOR44_45_RPO45R2_SIZE                   equ 0001h
RPOR44_45_RPO45R2_LENGTH                 equ 0001h
RPOR44_45_RPO45R2_MASK                   equ 0040h
RPOR44_45_RPO45R3_POSN                   equ 0007h
RPOR44_45_RPO45R3_POSITION               equ 0007h
RPOR44_45_RPO45R3_SIZE                   equ 0001h
RPOR44_45_RPO45R3_LENGTH                 equ 0001h
RPOR44_45_RPO45R3_MASK                   equ 0080h

// Register: RPOR46
#define RPOR46 RPOR46
RPOR46                                   equ 0E29h
// bitfield definitions
RPOR46_RPO46R_POSN                       equ 0000h
RPOR46_RPO46R_POSITION                   equ 0000h
RPOR46_RPO46R_SIZE                       equ 0004h
RPOR46_RPO46R_LENGTH                     equ 0004h
RPOR46_RPO46R_MASK                       equ 000Fh
RPOR46_RPO46R0_POSN                      equ 0000h
RPOR46_RPO46R0_POSITION                  equ 0000h
RPOR46_RPO46R0_SIZE                      equ 0001h
RPOR46_RPO46R0_LENGTH                    equ 0001h
RPOR46_RPO46R0_MASK                      equ 0001h
RPOR46_RPO46R1_POSN                      equ 0001h
RPOR46_RPO46R1_POSITION                  equ 0001h
RPOR46_RPO46R1_SIZE                      equ 0001h
RPOR46_RPO46R1_LENGTH                    equ 0001h
RPOR46_RPO46R1_MASK                      equ 0002h
RPOR46_RPO46R2_POSN                      equ 0002h
RPOR46_RPO46R2_POSITION                  equ 0002h
RPOR46_RPO46R2_SIZE                      equ 0001h
RPOR46_RPO46R2_LENGTH                    equ 0001h
RPOR46_RPO46R2_MASK                      equ 0004h
RPOR46_RPO46R3_POSN                      equ 0003h
RPOR46_RPO46R3_POSITION                  equ 0003h
RPOR46_RPO46R3_SIZE                      equ 0001h
RPOR46_RPO46R3_LENGTH                    equ 0001h
RPOR46_RPO46R3_MASK                      equ 0008h

// Register: RPINR0_1
#define RPINR0_1 RPINR0_1
RPINR0_1                                 equ 0E2Ah
// bitfield definitions
RPINR0_1_U1RXR_POSN                      equ 0000h
RPINR0_1_U1RXR_POSITION                  equ 0000h
RPINR0_1_U1RXR_SIZE                      equ 0004h
RPINR0_1_U1RXR_LENGTH                    equ 0004h
RPINR0_1_U1RXR_MASK                      equ 000Fh
RPINR0_1_U1TXR_POSN                      equ 0004h
RPINR0_1_U1TXR_POSITION                  equ 0004h
RPINR0_1_U1TXR_SIZE                      equ 0004h
RPINR0_1_U1TXR_LENGTH                    equ 0004h
RPINR0_1_U1TXR_MASK                      equ 00F0h
RPINR0_1_U1RXR0_POSN                     equ 0000h
RPINR0_1_U1RXR0_POSITION                 equ 0000h
RPINR0_1_U1RXR0_SIZE                     equ 0001h
RPINR0_1_U1RXR0_LENGTH                   equ 0001h
RPINR0_1_U1RXR0_MASK                     equ 0001h
RPINR0_1_U1RXR1_POSN                     equ 0001h
RPINR0_1_U1RXR1_POSITION                 equ 0001h
RPINR0_1_U1RXR1_SIZE                     equ 0001h
RPINR0_1_U1RXR1_LENGTH                   equ 0001h
RPINR0_1_U1RXR1_MASK                     equ 0002h
RPINR0_1_U1RXR2_POSN                     equ 0002h
RPINR0_1_U1RXR2_POSITION                 equ 0002h
RPINR0_1_U1RXR2_SIZE                     equ 0001h
RPINR0_1_U1RXR2_LENGTH                   equ 0001h
RPINR0_1_U1RXR2_MASK                     equ 0004h
RPINR0_1_U1RXR3_POSN                     equ 0003h
RPINR0_1_U1RXR3_POSITION                 equ 0003h
RPINR0_1_U1RXR3_SIZE                     equ 0001h
RPINR0_1_U1RXR3_LENGTH                   equ 0001h
RPINR0_1_U1RXR3_MASK                     equ 0008h
RPINR0_1_U1TXR0_POSN                     equ 0004h
RPINR0_1_U1TXR0_POSITION                 equ 0004h
RPINR0_1_U1TXR0_SIZE                     equ 0001h
RPINR0_1_U1TXR0_LENGTH                   equ 0001h
RPINR0_1_U1TXR0_MASK                     equ 0010h
RPINR0_1_U1TXR1_POSN                     equ 0005h
RPINR0_1_U1TXR1_POSITION                 equ 0005h
RPINR0_1_U1TXR1_SIZE                     equ 0001h
RPINR0_1_U1TXR1_LENGTH                   equ 0001h
RPINR0_1_U1TXR1_MASK                     equ 0020h
RPINR0_1_U1TXR2_POSN                     equ 0006h
RPINR0_1_U1TXR2_POSITION                 equ 0006h
RPINR0_1_U1TXR2_SIZE                     equ 0001h
RPINR0_1_U1TXR2_LENGTH                   equ 0001h
RPINR0_1_U1TXR2_MASK                     equ 0040h
RPINR0_1_U1TXR3_POSN                     equ 0007h
RPINR0_1_U1TXR3_POSITION                 equ 0007h
RPINR0_1_U1TXR3_SIZE                     equ 0001h
RPINR0_1_U1TXR3_LENGTH                   equ 0001h
RPINR0_1_U1TXR3_MASK                     equ 0080h

// Register: RPINR2_3
#define RPINR2_3 RPINR2_3
RPINR2_3                                 equ 0E2Bh
// bitfield definitions
RPINR2_3_U2RXR_POSN                      equ 0000h
RPINR2_3_U2RXR_POSITION                  equ 0000h
RPINR2_3_U2RXR_SIZE                      equ 0004h
RPINR2_3_U2RXR_LENGTH                    equ 0004h
RPINR2_3_U2RXR_MASK                      equ 000Fh
RPINR2_3_U2TXR_POSN                      equ 0004h
RPINR2_3_U2TXR_POSITION                  equ 0004h
RPINR2_3_U2TXR_SIZE                      equ 0004h
RPINR2_3_U2TXR_LENGTH                    equ 0004h
RPINR2_3_U2TXR_MASK                      equ 00F0h
RPINR2_3_U2RXR0_POSN                     equ 0000h
RPINR2_3_U2RXR0_POSITION                 equ 0000h
RPINR2_3_U2RXR0_SIZE                     equ 0001h
RPINR2_3_U2RXR0_LENGTH                   equ 0001h
RPINR2_3_U2RXR0_MASK                     equ 0001h
RPINR2_3_U2RXR1_POSN                     equ 0001h
RPINR2_3_U2RXR1_POSITION                 equ 0001h
RPINR2_3_U2RXR1_SIZE                     equ 0001h
RPINR2_3_U2RXR1_LENGTH                   equ 0001h
RPINR2_3_U2RXR1_MASK                     equ 0002h
RPINR2_3_U2RXR2_POSN                     equ 0002h
RPINR2_3_U2RXR2_POSITION                 equ 0002h
RPINR2_3_U2RXR2_SIZE                     equ 0001h
RPINR2_3_U2RXR2_LENGTH                   equ 0001h
RPINR2_3_U2RXR2_MASK                     equ 0004h
RPINR2_3_U2RXR3_POSN                     equ 0003h
RPINR2_3_U2RXR3_POSITION                 equ 0003h
RPINR2_3_U2RXR3_SIZE                     equ 0001h
RPINR2_3_U2RXR3_LENGTH                   equ 0001h
RPINR2_3_U2RXR3_MASK                     equ 0008h
RPINR2_3_U2TXR0_POSN                     equ 0004h
RPINR2_3_U2TXR0_POSITION                 equ 0004h
RPINR2_3_U2TXR0_SIZE                     equ 0001h
RPINR2_3_U2TXR0_LENGTH                   equ 0001h
RPINR2_3_U2TXR0_MASK                     equ 0010h
RPINR2_3_U2TXR1_POSN                     equ 0005h
RPINR2_3_U2TXR1_POSITION                 equ 0005h
RPINR2_3_U2TXR1_SIZE                     equ 0001h
RPINR2_3_U2TXR1_LENGTH                   equ 0001h
RPINR2_3_U2TXR1_MASK                     equ 0020h
RPINR2_3_U2TXR2_POSN                     equ 0006h
RPINR2_3_U2TXR2_POSITION                 equ 0006h
RPINR2_3_U2TXR2_SIZE                     equ 0001h
RPINR2_3_U2TXR2_LENGTH                   equ 0001h
RPINR2_3_U2TXR2_MASK                     equ 0040h
RPINR2_3_U2TXR3_POSN                     equ 0007h
RPINR2_3_U2TXR3_POSITION                 equ 0007h
RPINR2_3_U2TXR3_SIZE                     equ 0001h
RPINR2_3_U2TXR3_LENGTH                   equ 0001h
RPINR2_3_U2TXR3_MASK                     equ 0080h

// Register: RPINR4_5
#define RPINR4_5 RPINR4_5
RPINR4_5                                 equ 0E2Ch
// bitfield definitions
RPINR4_5_U3RXR_POSN                      equ 0000h
RPINR4_5_U3RXR_POSITION                  equ 0000h
RPINR4_5_U3RXR_SIZE                      equ 0004h
RPINR4_5_U3RXR_LENGTH                    equ 0004h
RPINR4_5_U3RXR_MASK                      equ 000Fh
RPINR4_5_U3TXR_POSN                      equ 0004h
RPINR4_5_U3TXR_POSITION                  equ 0004h
RPINR4_5_U3TXR_SIZE                      equ 0004h
RPINR4_5_U3TXR_LENGTH                    equ 0004h
RPINR4_5_U3TXR_MASK                      equ 00F0h
RPINR4_5_U3RXR0_POSN                     equ 0000h
RPINR4_5_U3RXR0_POSITION                 equ 0000h
RPINR4_5_U3RXR0_SIZE                     equ 0001h
RPINR4_5_U3RXR0_LENGTH                   equ 0001h
RPINR4_5_U3RXR0_MASK                     equ 0001h
RPINR4_5_U3RXR1_POSN                     equ 0001h
RPINR4_5_U3RXR1_POSITION                 equ 0001h
RPINR4_5_U3RXR1_SIZE                     equ 0001h
RPINR4_5_U3RXR1_LENGTH                   equ 0001h
RPINR4_5_U3RXR1_MASK                     equ 0002h
RPINR4_5_U3RXR2_POSN                     equ 0002h
RPINR4_5_U3RXR2_POSITION                 equ 0002h
RPINR4_5_U3RXR2_SIZE                     equ 0001h
RPINR4_5_U3RXR2_LENGTH                   equ 0001h
RPINR4_5_U3RXR2_MASK                     equ 0004h
RPINR4_5_U3RXR3_POSN                     equ 0003h
RPINR4_5_U3RXR3_POSITION                 equ 0003h
RPINR4_5_U3RXR3_SIZE                     equ 0001h
RPINR4_5_U3RXR3_LENGTH                   equ 0001h
RPINR4_5_U3RXR3_MASK                     equ 0008h
RPINR4_5_U3TXR0_POSN                     equ 0004h
RPINR4_5_U3TXR0_POSITION                 equ 0004h
RPINR4_5_U3TXR0_SIZE                     equ 0001h
RPINR4_5_U3TXR0_LENGTH                   equ 0001h
RPINR4_5_U3TXR0_MASK                     equ 0010h
RPINR4_5_U3TXR1_POSN                     equ 0005h
RPINR4_5_U3TXR1_POSITION                 equ 0005h
RPINR4_5_U3TXR1_SIZE                     equ 0001h
RPINR4_5_U3TXR1_LENGTH                   equ 0001h
RPINR4_5_U3TXR1_MASK                     equ 0020h
RPINR4_5_U3TXR2_POSN                     equ 0006h
RPINR4_5_U3TXR2_POSITION                 equ 0006h
RPINR4_5_U3TXR2_SIZE                     equ 0001h
RPINR4_5_U3TXR2_LENGTH                   equ 0001h
RPINR4_5_U3TXR2_MASK                     equ 0040h
RPINR4_5_U3TXR3_POSN                     equ 0007h
RPINR4_5_U3TXR3_POSITION                 equ 0007h
RPINR4_5_U3TXR3_SIZE                     equ 0001h
RPINR4_5_U3TXR3_LENGTH                   equ 0001h
RPINR4_5_U3TXR3_MASK                     equ 0080h

// Register: RPINR6_7
#define RPINR6_7 RPINR6_7
RPINR6_7                                 equ 0E2Dh
// bitfield definitions
RPINR6_7_U4RXR_POSN                      equ 0000h
RPINR6_7_U4RXR_POSITION                  equ 0000h
RPINR6_7_U4RXR_SIZE                      equ 0004h
RPINR6_7_U4RXR_LENGTH                    equ 0004h
RPINR6_7_U4RXR_MASK                      equ 000Fh
RPINR6_7_U4TXR_POSN                      equ 0004h
RPINR6_7_U4TXR_POSITION                  equ 0004h
RPINR6_7_U4TXR_SIZE                      equ 0004h
RPINR6_7_U4TXR_LENGTH                    equ 0004h
RPINR6_7_U4TXR_MASK                      equ 00F0h
RPINR6_7_U4RXR0_POSN                     equ 0000h
RPINR6_7_U4RXR0_POSITION                 equ 0000h
RPINR6_7_U4RXR0_SIZE                     equ 0001h
RPINR6_7_U4RXR0_LENGTH                   equ 0001h
RPINR6_7_U4RXR0_MASK                     equ 0001h
RPINR6_7_U4RXR1_POSN                     equ 0001h
RPINR6_7_U4RXR1_POSITION                 equ 0001h
RPINR6_7_U4RXR1_SIZE                     equ 0001h
RPINR6_7_U4RXR1_LENGTH                   equ 0001h
RPINR6_7_U4RXR1_MASK                     equ 0002h
RPINR6_7_U4RXR2_POSN                     equ 0002h
RPINR6_7_U4RXR2_POSITION                 equ 0002h
RPINR6_7_U4RXR2_SIZE                     equ 0001h
RPINR6_7_U4RXR2_LENGTH                   equ 0001h
RPINR6_7_U4RXR2_MASK                     equ 0004h
RPINR6_7_U4RXR3_POSN                     equ 0003h
RPINR6_7_U4RXR3_POSITION                 equ 0003h
RPINR6_7_U4RXR3_SIZE                     equ 0001h
RPINR6_7_U4RXR3_LENGTH                   equ 0001h
RPINR6_7_U4RXR3_MASK                     equ 0008h
RPINR6_7_U4TXR0_POSN                     equ 0004h
RPINR6_7_U4TXR0_POSITION                 equ 0004h
RPINR6_7_U4TXR0_SIZE                     equ 0001h
RPINR6_7_U4TXR0_LENGTH                   equ 0001h
RPINR6_7_U4TXR0_MASK                     equ 0010h
RPINR6_7_U4TXR1_POSN                     equ 0005h
RPINR6_7_U4TXR1_POSITION                 equ 0005h
RPINR6_7_U4TXR1_SIZE                     equ 0001h
RPINR6_7_U4TXR1_LENGTH                   equ 0001h
RPINR6_7_U4TXR1_MASK                     equ 0020h
RPINR6_7_U4TXR2_POSN                     equ 0006h
RPINR6_7_U4TXR2_POSITION                 equ 0006h
RPINR6_7_U4TXR2_SIZE                     equ 0001h
RPINR6_7_U4TXR2_LENGTH                   equ 0001h
RPINR6_7_U4TXR2_MASK                     equ 0040h
RPINR6_7_U4TXR3_POSN                     equ 0007h
RPINR6_7_U4TXR3_POSITION                 equ 0007h
RPINR6_7_U4TXR3_SIZE                     equ 0001h
RPINR6_7_U4TXR3_LENGTH                   equ 0001h
RPINR6_7_U4TXR3_MASK                     equ 0080h

// Register: RPINR8_9
#define RPINR8_9 RPINR8_9
RPINR8_9                                 equ 0E2Eh
// bitfield definitions
RPINR8_9_SCK1R_POSN                      equ 0000h
RPINR8_9_SCK1R_POSITION                  equ 0000h
RPINR8_9_SCK1R_SIZE                      equ 0004h
RPINR8_9_SCK1R_LENGTH                    equ 0004h
RPINR8_9_SCK1R_MASK                      equ 000Fh
RPINR8_9_SDI1R_POSN                      equ 0004h
RPINR8_9_SDI1R_POSITION                  equ 0004h
RPINR8_9_SDI1R_SIZE                      equ 0004h
RPINR8_9_SDI1R_LENGTH                    equ 0004h
RPINR8_9_SDI1R_MASK                      equ 00F0h
RPINR8_9_SCK1R0_POSN                     equ 0000h
RPINR8_9_SCK1R0_POSITION                 equ 0000h
RPINR8_9_SCK1R0_SIZE                     equ 0001h
RPINR8_9_SCK1R0_LENGTH                   equ 0001h
RPINR8_9_SCK1R0_MASK                     equ 0001h
RPINR8_9_SCK1R1_POSN                     equ 0001h
RPINR8_9_SCK1R1_POSITION                 equ 0001h
RPINR8_9_SCK1R1_SIZE                     equ 0001h
RPINR8_9_SCK1R1_LENGTH                   equ 0001h
RPINR8_9_SCK1R1_MASK                     equ 0002h
RPINR8_9_SCK1R2_POSN                     equ 0002h
RPINR8_9_SCK1R2_POSITION                 equ 0002h
RPINR8_9_SCK1R2_SIZE                     equ 0001h
RPINR8_9_SCK1R2_LENGTH                   equ 0001h
RPINR8_9_SCK1R2_MASK                     equ 0004h
RPINR8_9_SCK1R3_POSN                     equ 0003h
RPINR8_9_SCK1R3_POSITION                 equ 0003h
RPINR8_9_SCK1R3_SIZE                     equ 0001h
RPINR8_9_SCK1R3_LENGTH                   equ 0001h
RPINR8_9_SCK1R3_MASK                     equ 0008h
RPINR8_9_SDI1R0_POSN                     equ 0004h
RPINR8_9_SDI1R0_POSITION                 equ 0004h
RPINR8_9_SDI1R0_SIZE                     equ 0001h
RPINR8_9_SDI1R0_LENGTH                   equ 0001h
RPINR8_9_SDI1R0_MASK                     equ 0010h
RPINR8_9_SDI1R1_POSN                     equ 0005h
RPINR8_9_SDI1R1_POSITION                 equ 0005h
RPINR8_9_SDI1R1_SIZE                     equ 0001h
RPINR8_9_SDI1R1_LENGTH                   equ 0001h
RPINR8_9_SDI1R1_MASK                     equ 0020h
RPINR8_9_SDI1R2_POSN                     equ 0006h
RPINR8_9_SDI1R2_POSITION                 equ 0006h
RPINR8_9_SDI1R2_SIZE                     equ 0001h
RPINR8_9_SDI1R2_LENGTH                   equ 0001h
RPINR8_9_SDI1R2_MASK                     equ 0040h
RPINR8_9_SDI1R3_POSN                     equ 0007h
RPINR8_9_SDI1R3_POSITION                 equ 0007h
RPINR8_9_SDI1R3_SIZE                     equ 0001h
RPINR8_9_SDI1R3_LENGTH                   equ 0001h
RPINR8_9_SDI1R3_MASK                     equ 0080h

// Register: RPINR10_11
#define RPINR10_11 RPINR10_11
RPINR10_11                               equ 0E2Fh
// bitfield definitions
RPINR10_11_SS1R_POSN                     equ 0000h
RPINR10_11_SS1R_POSITION                 equ 0000h
RPINR10_11_SS1R_SIZE                     equ 0004h
RPINR10_11_SS1R_LENGTH                   equ 0004h
RPINR10_11_SS1R_MASK                     equ 000Fh
RPINR10_11_SCK2R_POSN                    equ 0004h
RPINR10_11_SCK2R_POSITION                equ 0004h
RPINR10_11_SCK2R_SIZE                    equ 0004h
RPINR10_11_SCK2R_LENGTH                  equ 0004h
RPINR10_11_SCK2R_MASK                    equ 00F0h
RPINR10_11_SS1R0_POSN                    equ 0000h
RPINR10_11_SS1R0_POSITION                equ 0000h
RPINR10_11_SS1R0_SIZE                    equ 0001h
RPINR10_11_SS1R0_LENGTH                  equ 0001h
RPINR10_11_SS1R0_MASK                    equ 0001h
RPINR10_11_SS1R1_POSN                    equ 0001h
RPINR10_11_SS1R1_POSITION                equ 0001h
RPINR10_11_SS1R1_SIZE                    equ 0001h
RPINR10_11_SS1R1_LENGTH                  equ 0001h
RPINR10_11_SS1R1_MASK                    equ 0002h
RPINR10_11_SS1R2_POSN                    equ 0002h
RPINR10_11_SS1R2_POSITION                equ 0002h
RPINR10_11_SS1R2_SIZE                    equ 0001h
RPINR10_11_SS1R2_LENGTH                  equ 0001h
RPINR10_11_SS1R2_MASK                    equ 0004h
RPINR10_11_SS1R3_POSN                    equ 0003h
RPINR10_11_SS1R3_POSITION                equ 0003h
RPINR10_11_SS1R3_SIZE                    equ 0001h
RPINR10_11_SS1R3_LENGTH                  equ 0001h
RPINR10_11_SS1R3_MASK                    equ 0008h
RPINR10_11_SCK2R0_POSN                   equ 0004h
RPINR10_11_SCK2R0_POSITION               equ 0004h
RPINR10_11_SCK2R0_SIZE                   equ 0001h
RPINR10_11_SCK2R0_LENGTH                 equ 0001h
RPINR10_11_SCK2R0_MASK                   equ 0010h
RPINR10_11_SCK2R1_POSN                   equ 0005h
RPINR10_11_SCK2R1_POSITION               equ 0005h
RPINR10_11_SCK2R1_SIZE                   equ 0001h
RPINR10_11_SCK2R1_LENGTH                 equ 0001h
RPINR10_11_SCK2R1_MASK                   equ 0020h
RPINR10_11_SCK2R2_POSN                   equ 0006h
RPINR10_11_SCK2R2_POSITION               equ 0006h
RPINR10_11_SCK2R2_SIZE                   equ 0001h
RPINR10_11_SCK2R2_LENGTH                 equ 0001h
RPINR10_11_SCK2R2_MASK                   equ 0040h
RPINR10_11_SCK2R3_POSN                   equ 0007h
RPINR10_11_SCK2R3_POSITION               equ 0007h
RPINR10_11_SCK2R3_SIZE                   equ 0001h
RPINR10_11_SCK2R3_LENGTH                 equ 0001h
RPINR10_11_SCK2R3_MASK                   equ 0080h

