GopalSaraf/Practicals/PSDL/include/proc/pic18f86j99.inc
// Register: RPINR12_13
#define RPINR12_13 RPINR12_13
RPINR12_13                               equ 0E30h
// bitfield definitions
RPINR12_13_SDI2R_POSN                    equ 0000h
RPINR12_13_SDI2R_POSITION                equ 0000h
RPINR12_13_SDI2R_SIZE                    equ 0004h
RPINR12_13_SDI2R_LENGTH                  equ 0004h
RPINR12_13_SDI2R_MASK                    equ 000Fh
RPINR12_13_SS2R_POSN                     equ 0004h
RPINR12_13_SS2R_POSITION                 equ 0004h
RPINR12_13_SS2R_SIZE                     equ 0004h
RPINR12_13_SS2R_LENGTH                   equ 0004h
RPINR12_13_SS2R_MASK                     equ 00F0h
RPINR12_13_SDI2R0_POSN                   equ 0000h
RPINR12_13_SDI2R0_POSITION               equ 0000h
RPINR12_13_SDI2R0_SIZE                   equ 0001h
RPINR12_13_SDI2R0_LENGTH                 equ 0001h
RPINR12_13_SDI2R0_MASK                   equ 0001h
RPINR12_13_SDI2R1_POSN                   equ 0001h
RPINR12_13_SDI2R1_POSITION               equ 0001h
RPINR12_13_SDI2R1_SIZE                   equ 0001h
RPINR12_13_SDI2R1_LENGTH                 equ 0001h
RPINR12_13_SDI2R1_MASK                   equ 0002h
RPINR12_13_SDI2R2_POSN                   equ 0002h
RPINR12_13_SDI2R2_POSITION               equ 0002h
RPINR12_13_SDI2R2_SIZE                   equ 0001h
RPINR12_13_SDI2R2_LENGTH                 equ 0001h
RPINR12_13_SDI2R2_MASK                   equ 0004h
RPINR12_13_SDI2R3_POSN                   equ 0003h
RPINR12_13_SDI2R3_POSITION               equ 0003h
RPINR12_13_SDI2R3_SIZE                   equ 0001h
RPINR12_13_SDI2R3_LENGTH                 equ 0001h
RPINR12_13_SDI2R3_MASK                   equ 0008h
RPINR12_13_SS2R0_POSN                    equ 0004h
RPINR12_13_SS2R0_POSITION                equ 0004h
RPINR12_13_SS2R0_SIZE                    equ 0001h
RPINR12_13_SS2R0_LENGTH                  equ 0001h
RPINR12_13_SS2R0_MASK                    equ 0010h
RPINR12_13_SS2R1_POSN                    equ 0005h
RPINR12_13_SS2R1_POSITION                equ 0005h
RPINR12_13_SS2R1_SIZE                    equ 0001h
RPINR12_13_SS2R1_LENGTH                  equ 0001h
RPINR12_13_SS2R1_MASK                    equ 0020h
RPINR12_13_SS2R2_POSN                    equ 0006h
RPINR12_13_SS2R2_POSITION                equ 0006h
RPINR12_13_SS2R2_SIZE                    equ 0001h
RPINR12_13_SS2R2_LENGTH                  equ 0001h
RPINR12_13_SS2R2_MASK                    equ 0040h
RPINR12_13_SS2R3_POSN                    equ 0007h
RPINR12_13_SS2R3_POSITION                equ 0007h
RPINR12_13_SS2R3_SIZE                    equ 0001h
RPINR12_13_SS2R3_LENGTH                  equ 0001h
RPINR12_13_SS2R3_MASK                    equ 0080h

// Register: RPINR14_15
#define RPINR14_15 RPINR14_15
RPINR14_15                               equ 0E31h
// bitfield definitions
RPINR14_15_FLT0R_POSN                    equ 0000h
RPINR14_15_FLT0R_POSITION                equ 0000h
RPINR14_15_FLT0R_SIZE                    equ 0004h
RPINR14_15_FLT0R_LENGTH                  equ 0004h
RPINR14_15_FLT0R_MASK                    equ 000Fh
RPINR14_15_ECCP1R_POSN                   equ 0004h
RPINR14_15_ECCP1R_POSITION               equ 0004h
RPINR14_15_ECCP1R_SIZE                   equ 0004h
RPINR14_15_ECCP1R_LENGTH                 equ 0004h
RPINR14_15_ECCP1R_MASK                   equ 00F0h
RPINR14_15_FLT0R0_POSN                   equ 0000h
RPINR14_15_FLT0R0_POSITION               equ 0000h
RPINR14_15_FLT0R0_SIZE                   equ 0001h
RPINR14_15_FLT0R0_LENGTH                 equ 0001h
RPINR14_15_FLT0R0_MASK                   equ 0001h
RPINR14_15_FLT0R1_POSN                   equ 0001h
RPINR14_15_FLT0R1_POSITION               equ 0001h
RPINR14_15_FLT0R1_SIZE                   equ 0001h
RPINR14_15_FLT0R1_LENGTH                 equ 0001h
RPINR14_15_FLT0R1_MASK                   equ 0002h
RPINR14_15_FLT0R2_POSN                   equ 0002h
RPINR14_15_FLT0R2_POSITION               equ 0002h
RPINR14_15_FLT0R2_SIZE                   equ 0001h
RPINR14_15_FLT0R2_LENGTH                 equ 0001h
RPINR14_15_FLT0R2_MASK                   equ 0004h
RPINR14_15_FLT0R3_POSN                   equ 0003h
RPINR14_15_FLT0R3_POSITION               equ 0003h
RPINR14_15_FLT0R3_SIZE                   equ 0001h
RPINR14_15_FLT0R3_LENGTH                 equ 0001h
RPINR14_15_FLT0R3_MASK                   equ 0008h
RPINR14_15_ECCP1R0_POSN                  equ 0004h
RPINR14_15_ECCP1R0_POSITION              equ 0004h
RPINR14_15_ECCP1R0_SIZE                  equ 0001h
RPINR14_15_ECCP1R0_LENGTH                equ 0001h
RPINR14_15_ECCP1R0_MASK                  equ 0010h
RPINR14_15_ECCP1R1_POSN                  equ 0005h
RPINR14_15_ECCP1R1_POSITION              equ 0005h
RPINR14_15_ECCP1R1_SIZE                  equ 0001h
RPINR14_15_ECCP1R1_LENGTH                equ 0001h
RPINR14_15_ECCP1R1_MASK                  equ 0020h
RPINR14_15_ECCP1R2_POSN                  equ 0006h
RPINR14_15_ECCP1R2_POSITION              equ 0006h
RPINR14_15_ECCP1R2_SIZE                  equ 0001h
RPINR14_15_ECCP1R2_LENGTH                equ 0001h
RPINR14_15_ECCP1R2_MASK                  equ 0040h
RPINR14_15_ECCP1R3_POSN                  equ 0007h
RPINR14_15_ECCP1R3_POSITION              equ 0007h
RPINR14_15_ECCP1R3_SIZE                  equ 0001h
RPINR14_15_ECCP1R3_LENGTH                equ 0001h
RPINR14_15_ECCP1R3_MASK                  equ 0080h

// Register: RPINR16_17
#define RPINR16_17 RPINR16_17
RPINR16_17                               equ 0E32h
// bitfield definitions
RPINR16_17_ECCP2R_POSN                   equ 0000h
RPINR16_17_ECCP2R_POSITION               equ 0000h
RPINR16_17_ECCP2R_SIZE                   equ 0004h
RPINR16_17_ECCP2R_LENGTH                 equ 0004h
RPINR16_17_ECCP2R_MASK                   equ 000Fh
RPINR16_17_ECCP3R_POSN                   equ 0004h
RPINR16_17_ECCP3R_POSITION               equ 0004h
RPINR16_17_ECCP3R_SIZE                   equ 0004h
RPINR16_17_ECCP3R_LENGTH                 equ 0004h
RPINR16_17_ECCP3R_MASK                   equ 00F0h
RPINR16_17_ECCP2R0_POSN                  equ 0000h
RPINR16_17_ECCP2R0_POSITION              equ 0000h
RPINR16_17_ECCP2R0_SIZE                  equ 0001h
RPINR16_17_ECCP2R0_LENGTH                equ 0001h
RPINR16_17_ECCP2R0_MASK                  equ 0001h
RPINR16_17_ECCP2R1_POSN                  equ 0001h
RPINR16_17_ECCP2R1_POSITION              equ 0001h
RPINR16_17_ECCP2R1_SIZE                  equ 0001h
RPINR16_17_ECCP2R1_LENGTH                equ 0001h
RPINR16_17_ECCP2R1_MASK                  equ 0002h
RPINR16_17_ECCP2R2_POSN                  equ 0002h
RPINR16_17_ECCP2R2_POSITION              equ 0002h
RPINR16_17_ECCP2R2_SIZE                  equ 0001h
RPINR16_17_ECCP2R2_LENGTH                equ 0001h
RPINR16_17_ECCP2R2_MASK                  equ 0004h
RPINR16_17_ECCP2R3_POSN                  equ 0003h
RPINR16_17_ECCP2R3_POSITION              equ 0003h
RPINR16_17_ECCP2R3_SIZE                  equ 0001h
RPINR16_17_ECCP2R3_LENGTH                equ 0001h
RPINR16_17_ECCP2R3_MASK                  equ 0008h
RPINR16_17_ECCP3R0_POSN                  equ 0004h
RPINR16_17_ECCP3R0_POSITION              equ 0004h
RPINR16_17_ECCP3R0_SIZE                  equ 0001h
RPINR16_17_ECCP3R0_LENGTH                equ 0001h
RPINR16_17_ECCP3R0_MASK                  equ 0010h
RPINR16_17_ECCP3R1_POSN                  equ 0005h
RPINR16_17_ECCP3R1_POSITION              equ 0005h
RPINR16_17_ECCP3R1_SIZE                  equ 0001h
RPINR16_17_ECCP3R1_LENGTH                equ 0001h
RPINR16_17_ECCP3R1_MASK                  equ 0020h
RPINR16_17_ECCP3R2_POSN                  equ 0006h
RPINR16_17_ECCP3R2_POSITION              equ 0006h
RPINR16_17_ECCP3R2_SIZE                  equ 0001h
RPINR16_17_ECCP3R2_LENGTH                equ 0001h
RPINR16_17_ECCP3R2_MASK                  equ 0040h
RPINR16_17_ECCP3R3_POSN                  equ 0007h
RPINR16_17_ECCP3R3_POSITION              equ 0007h
RPINR16_17_ECCP3R3_SIZE                  equ 0001h
RPINR16_17_ECCP3R3_LENGTH                equ 0001h
RPINR16_17_ECCP3R3_MASK                  equ 0080h

// Register: RPINR18_19
#define RPINR18_19 RPINR18_19
RPINR18_19                               equ 0E33h
// bitfield definitions
RPINR18_19_IOC0R_POSN                    equ 0000h
RPINR18_19_IOC0R_POSITION                equ 0000h
RPINR18_19_IOC0R_SIZE                    equ 0004h
RPINR18_19_IOC0R_LENGTH                  equ 0004h
RPINR18_19_IOC0R_MASK                    equ 000Fh
RPINR18_19_IOC1R_POSN                    equ 0004h
RPINR18_19_IOC1R_POSITION                equ 0004h
RPINR18_19_IOC1R_SIZE                    equ 0004h
RPINR18_19_IOC1R_LENGTH                  equ 0004h
RPINR18_19_IOC1R_MASK                    equ 00F0h
RPINR18_19_IOC0R0_POSN                   equ 0000h
RPINR18_19_IOC0R0_POSITION               equ 0000h
RPINR18_19_IOC0R0_SIZE                   equ 0001h
RPINR18_19_IOC0R0_LENGTH                 equ 0001h
RPINR18_19_IOC0R0_MASK                   equ 0001h
RPINR18_19_IOC0R1_POSN                   equ 0001h
RPINR18_19_IOC0R1_POSITION               equ 0001h
RPINR18_19_IOC0R1_SIZE                   equ 0001h
RPINR18_19_IOC0R1_LENGTH                 equ 0001h
RPINR18_19_IOC0R1_MASK                   equ 0002h
RPINR18_19_IOC0R2_POSN                   equ 0002h
RPINR18_19_IOC0R2_POSITION               equ 0002h
RPINR18_19_IOC0R2_SIZE                   equ 0001h
RPINR18_19_IOC0R2_LENGTH                 equ 0001h
RPINR18_19_IOC0R2_MASK                   equ 0004h
RPINR18_19_IOC0R3_POSN                   equ 0003h
RPINR18_19_IOC0R3_POSITION               equ 0003h
RPINR18_19_IOC0R3_SIZE                   equ 0001h
RPINR18_19_IOC0R3_LENGTH                 equ 0001h
RPINR18_19_IOC0R3_MASK                   equ 0008h
RPINR18_19_IOC1R0_POSN                   equ 0004h
RPINR18_19_IOC1R0_POSITION               equ 0004h
RPINR18_19_IOC1R0_SIZE                   equ 0001h
RPINR18_19_IOC1R0_LENGTH                 equ 0001h
RPINR18_19_IOC1R0_MASK                   equ 0010h
RPINR18_19_IOC1R1_POSN                   equ 0005h
RPINR18_19_IOC1R1_POSITION               equ 0005h
RPINR18_19_IOC1R1_SIZE                   equ 0001h
RPINR18_19_IOC1R1_LENGTH                 equ 0001h
RPINR18_19_IOC1R1_MASK                   equ 0020h
RPINR18_19_IOC1R2_POSN                   equ 0006h
RPINR18_19_IOC1R2_POSITION               equ 0006h
RPINR18_19_IOC1R2_SIZE                   equ 0001h
RPINR18_19_IOC1R2_LENGTH                 equ 0001h
RPINR18_19_IOC1R2_MASK                   equ 0040h
RPINR18_19_IOC1R3_POSN                   equ 0007h
RPINR18_19_IOC1R3_POSITION               equ 0007h
RPINR18_19_IOC1R3_SIZE                   equ 0001h
RPINR18_19_IOC1R3_LENGTH                 equ 0001h
RPINR18_19_IOC1R3_MASK                   equ 0080h

