GopalSaraf/Practicals/PSDL/include/proc/pic18f86j99.inc
// Register: LCDDATA48
#define LCDDATA48 LCDDATA48
LCDDATA48                                equ 0EBEh
// bitfield definitions
LCDDATA48_S00C6_POSN                     equ 0000h
LCDDATA48_S00C6_POSITION                 equ 0000h
LCDDATA48_S00C6_SIZE                     equ 0001h
LCDDATA48_S00C6_LENGTH                   equ 0001h
LCDDATA48_S00C6_MASK                     equ 0001h
LCDDATA48_S01C6_POSN                     equ 0001h
LCDDATA48_S01C6_POSITION                 equ 0001h
LCDDATA48_S01C6_SIZE                     equ 0001h
LCDDATA48_S01C6_LENGTH                   equ 0001h
LCDDATA48_S01C6_MASK                     equ 0002h
LCDDATA48_S02C6_POSN                     equ 0002h
LCDDATA48_S02C6_POSITION                 equ 0002h
LCDDATA48_S02C6_SIZE                     equ 0001h
LCDDATA48_S02C6_LENGTH                   equ 0001h
LCDDATA48_S02C6_MASK                     equ 0004h
LCDDATA48_S03C6_POSN                     equ 0003h
LCDDATA48_S03C6_POSITION                 equ 0003h
LCDDATA48_S03C6_SIZE                     equ 0001h
LCDDATA48_S03C6_LENGTH                   equ 0001h
LCDDATA48_S03C6_MASK                     equ 0008h
LCDDATA48_S04C6_POSN                     equ 0004h
LCDDATA48_S04C6_POSITION                 equ 0004h
LCDDATA48_S04C6_SIZE                     equ 0001h
LCDDATA48_S04C6_LENGTH                   equ 0001h
LCDDATA48_S04C6_MASK                     equ 0010h
LCDDATA48_S05C6_POSN                     equ 0005h
LCDDATA48_S05C6_POSITION                 equ 0005h
LCDDATA48_S05C6_SIZE                     equ 0001h
LCDDATA48_S05C6_LENGTH                   equ 0001h
LCDDATA48_S05C6_MASK                     equ 0020h
LCDDATA48_S06C6_POSN                     equ 0006h
LCDDATA48_S06C6_POSITION                 equ 0006h
LCDDATA48_S06C6_SIZE                     equ 0001h
LCDDATA48_S06C6_LENGTH                   equ 0001h
LCDDATA48_S06C6_MASK                     equ 0040h
LCDDATA48_S07C6_POSN                     equ 0007h
LCDDATA48_S07C6_POSITION                 equ 0007h
LCDDATA48_S07C6_SIZE                     equ 0001h
LCDDATA48_S07C6_LENGTH                   equ 0001h
LCDDATA48_S07C6_MASK                     equ 0080h

// Register: LCDDATA49
#define LCDDATA49 LCDDATA49
LCDDATA49                                equ 0EBFh
// bitfield definitions
LCDDATA49_S08C6_POSN                     equ 0000h
LCDDATA49_S08C6_POSITION                 equ 0000h
LCDDATA49_S08C6_SIZE                     equ 0001h
LCDDATA49_S08C6_LENGTH                   equ 0001h
LCDDATA49_S08C6_MASK                     equ 0001h
LCDDATA49_S09C6_POSN                     equ 0001h
LCDDATA49_S09C6_POSITION                 equ 0001h
LCDDATA49_S09C6_SIZE                     equ 0001h
LCDDATA49_S09C6_LENGTH                   equ 0001h
LCDDATA49_S09C6_MASK                     equ 0002h
LCDDATA49_S10C6_POSN                     equ 0002h
LCDDATA49_S10C6_POSITION                 equ 0002h
LCDDATA49_S10C6_SIZE                     equ 0001h
LCDDATA49_S10C6_LENGTH                   equ 0001h
LCDDATA49_S10C6_MASK                     equ 0004h
LCDDATA49_S11C6_POSN                     equ 0003h
LCDDATA49_S11C6_POSITION                 equ 0003h
LCDDATA49_S11C6_SIZE                     equ 0001h
LCDDATA49_S11C6_LENGTH                   equ 0001h
LCDDATA49_S11C6_MASK                     equ 0008h
LCDDATA49_S12C6_POSN                     equ 0004h
LCDDATA49_S12C6_POSITION                 equ 0004h
LCDDATA49_S12C6_SIZE                     equ 0001h
LCDDATA49_S12C6_LENGTH                   equ 0001h
LCDDATA49_S12C6_MASK                     equ 0010h
LCDDATA49_S13C6_POSN                     equ 0005h
LCDDATA49_S13C6_POSITION                 equ 0005h
LCDDATA49_S13C6_SIZE                     equ 0001h
LCDDATA49_S13C6_LENGTH                   equ 0001h
LCDDATA49_S13C6_MASK                     equ 0020h
LCDDATA49_S14C6_POSN                     equ 0006h
LCDDATA49_S14C6_POSITION                 equ 0006h
LCDDATA49_S14C6_SIZE                     equ 0001h
LCDDATA49_S14C6_LENGTH                   equ 0001h
LCDDATA49_S14C6_MASK                     equ 0040h
LCDDATA49_S15C6_POSN                     equ 0007h
LCDDATA49_S15C6_POSITION                 equ 0007h
LCDDATA49_S15C6_SIZE                     equ 0001h
LCDDATA49_S15C6_LENGTH                   equ 0001h
LCDDATA49_S15C6_MASK                     equ 0080h

// Register: LCDDATA50
#define LCDDATA50 LCDDATA50
LCDDATA50                                equ 0EC0h
// bitfield definitions
LCDDATA50_S16C6_POSN                     equ 0000h
LCDDATA50_S16C6_POSITION                 equ 0000h
LCDDATA50_S16C6_SIZE                     equ 0001h
LCDDATA50_S16C6_LENGTH                   equ 0001h
LCDDATA50_S16C6_MASK                     equ 0001h
LCDDATA50_S17C6_POSN                     equ 0001h
LCDDATA50_S17C6_POSITION                 equ 0001h
LCDDATA50_S17C6_SIZE                     equ 0001h
LCDDATA50_S17C6_LENGTH                   equ 0001h
LCDDATA50_S17C6_MASK                     equ 0002h
LCDDATA50_S18C6_POSN                     equ 0002h
LCDDATA50_S18C6_POSITION                 equ 0002h
LCDDATA50_S18C6_SIZE                     equ 0001h
LCDDATA50_S18C6_LENGTH                   equ 0001h
LCDDATA50_S18C6_MASK                     equ 0004h
LCDDATA50_S19C6_POSN                     equ 0003h
LCDDATA50_S19C6_POSITION                 equ 0003h
LCDDATA50_S19C6_SIZE                     equ 0001h
LCDDATA50_S19C6_LENGTH                   equ 0001h
LCDDATA50_S19C6_MASK                     equ 0008h
LCDDATA50_S20C6_POSN                     equ 0004h
LCDDATA50_S20C6_POSITION                 equ 0004h
LCDDATA50_S20C6_SIZE                     equ 0001h
LCDDATA50_S20C6_LENGTH                   equ 0001h
LCDDATA50_S20C6_MASK                     equ 0010h
LCDDATA50_S21C6_POSN                     equ 0005h
LCDDATA50_S21C6_POSITION                 equ 0005h
LCDDATA50_S21C6_SIZE                     equ 0001h
LCDDATA50_S21C6_LENGTH                   equ 0001h
LCDDATA50_S21C6_MASK                     equ 0020h
LCDDATA50_S22C6_POSN                     equ 0006h
LCDDATA50_S22C6_POSITION                 equ 0006h
LCDDATA50_S22C6_SIZE                     equ 0001h
LCDDATA50_S22C6_LENGTH                   equ 0001h
LCDDATA50_S22C6_MASK                     equ 0040h
LCDDATA50_S23C6_POSN                     equ 0007h
LCDDATA50_S23C6_POSITION                 equ 0007h
LCDDATA50_S23C6_SIZE                     equ 0001h
LCDDATA50_S23C6_LENGTH                   equ 0001h
LCDDATA50_S23C6_MASK                     equ 0080h

// Register: LCDDATA51
#define LCDDATA51 LCDDATA51
LCDDATA51                                equ 0EC1h
// bitfield definitions
LCDDATA51_S24C6_POSN                     equ 0000h
LCDDATA51_S24C6_POSITION                 equ 0000h
LCDDATA51_S24C6_SIZE                     equ 0001h
LCDDATA51_S24C6_LENGTH                   equ 0001h
LCDDATA51_S24C6_MASK                     equ 0001h
LCDDATA51_S25C6_POSN                     equ 0001h
LCDDATA51_S25C6_POSITION                 equ 0001h
LCDDATA51_S25C6_SIZE                     equ 0001h
LCDDATA51_S25C6_LENGTH                   equ 0001h
LCDDATA51_S25C6_MASK                     equ 0002h
LCDDATA51_S26C6_POSN                     equ 0002h
LCDDATA51_S26C6_POSITION                 equ 0002h
LCDDATA51_S26C6_SIZE                     equ 0001h
LCDDATA51_S26C6_LENGTH                   equ 0001h
LCDDATA51_S26C6_MASK                     equ 0004h
LCDDATA51_S27C6_POSN                     equ 0003h
LCDDATA51_S27C6_POSITION                 equ 0003h
LCDDATA51_S27C6_SIZE                     equ 0001h
LCDDATA51_S27C6_LENGTH                   equ 0001h
LCDDATA51_S27C6_MASK                     equ 0008h
LCDDATA51_S28C6_POSN                     equ 0004h
LCDDATA51_S28C6_POSITION                 equ 0004h
LCDDATA51_S28C6_SIZE                     equ 0001h
LCDDATA51_S28C6_LENGTH                   equ 0001h
LCDDATA51_S28C6_MASK                     equ 0010h
LCDDATA51_S29C6_POSN                     equ 0005h
LCDDATA51_S29C6_POSITION                 equ 0005h
LCDDATA51_S29C6_SIZE                     equ 0001h
LCDDATA51_S29C6_LENGTH                   equ 0001h
LCDDATA51_S29C6_MASK                     equ 0020h
LCDDATA51_S30C6_POSN                     equ 0006h
LCDDATA51_S30C6_POSITION                 equ 0006h
LCDDATA51_S30C6_SIZE                     equ 0001h
LCDDATA51_S30C6_LENGTH                   equ 0001h
LCDDATA51_S30C6_MASK                     equ 0040h
LCDDATA51_S31C6_POSN                     equ 0007h
LCDDATA51_S31C6_POSITION                 equ 0007h
LCDDATA51_S31C6_SIZE                     equ 0001h
LCDDATA51_S31C6_LENGTH                   equ 0001h
LCDDATA51_S31C6_MASK                     equ 0080h

// Register: LCDDATA52
#define LCDDATA52 LCDDATA52
LCDDATA52                                equ 0EC2h
// bitfield definitions
LCDDATA52_S32C6_POSN                     equ 0000h
LCDDATA52_S32C6_POSITION                 equ 0000h
LCDDATA52_S32C6_SIZE                     equ 0001h
LCDDATA52_S32C6_LENGTH                   equ 0001h
LCDDATA52_S32C6_MASK                     equ 0001h
LCDDATA52_S33C6_POSN                     equ 0001h
LCDDATA52_S33C6_POSITION                 equ 0001h
LCDDATA52_S33C6_SIZE                     equ 0001h
LCDDATA52_S33C6_LENGTH                   equ 0001h
LCDDATA52_S33C6_MASK                     equ 0002h
LCDDATA52_S34C6_POSN                     equ 0002h
LCDDATA52_S34C6_POSITION                 equ 0002h
LCDDATA52_S34C6_SIZE                     equ 0001h
LCDDATA52_S34C6_LENGTH                   equ 0001h
LCDDATA52_S34C6_MASK                     equ 0004h
LCDDATA52_S35C6_POSN                     equ 0003h
LCDDATA52_S35C6_POSITION                 equ 0003h
LCDDATA52_S35C6_SIZE                     equ 0001h
LCDDATA52_S35C6_LENGTH                   equ 0001h
LCDDATA52_S35C6_MASK                     equ 0008h
LCDDATA52_S36C6_POSN                     equ 0004h
LCDDATA52_S36C6_POSITION                 equ 0004h
LCDDATA52_S36C6_SIZE                     equ 0001h
LCDDATA52_S36C6_LENGTH                   equ 0001h
LCDDATA52_S36C6_MASK                     equ 0010h
LCDDATA52_S37C6_POSN                     equ 0005h
LCDDATA52_S37C6_POSITION                 equ 0005h
LCDDATA52_S37C6_SIZE                     equ 0001h
LCDDATA52_S37C6_LENGTH                   equ 0001h
LCDDATA52_S37C6_MASK                     equ 0020h
LCDDATA52_S38C6_POSN                     equ 0006h
LCDDATA52_S38C6_POSITION                 equ 0006h
LCDDATA52_S38C6_SIZE                     equ 0001h
LCDDATA52_S38C6_LENGTH                   equ 0001h
LCDDATA52_S38C6_MASK                     equ 0040h
LCDDATA52_S39C6_POSN                     equ 0007h
LCDDATA52_S39C6_POSITION                 equ 0007h
LCDDATA52_S39C6_SIZE                     equ 0001h
LCDDATA52_S39C6_LENGTH                   equ 0001h
LCDDATA52_S39C6_MASK                     equ 0080h

// Register: LCDDATA53
#define LCDDATA53 LCDDATA53
LCDDATA53                                equ 0EC3h
// bitfield definitions
LCDDATA53_S40C6_POSN                     equ 0000h
LCDDATA53_S40C6_POSITION                 equ 0000h
LCDDATA53_S40C6_SIZE                     equ 0001h
LCDDATA53_S40C6_LENGTH                   equ 0001h
LCDDATA53_S40C6_MASK                     equ 0001h
LCDDATA53_S41C6_POSN                     equ 0001h
LCDDATA53_S41C6_POSITION                 equ 0001h
LCDDATA53_S41C6_SIZE                     equ 0001h
LCDDATA53_S41C6_LENGTH                   equ 0001h
LCDDATA53_S41C6_MASK                     equ 0002h
LCDDATA53_S42C6_POSN                     equ 0002h
LCDDATA53_S42C6_POSITION                 equ 0002h
LCDDATA53_S42C6_SIZE                     equ 0001h
LCDDATA53_S42C6_LENGTH                   equ 0001h
LCDDATA53_S42C6_MASK                     equ 0004h
LCDDATA53_S43C6_POSN                     equ 0003h
LCDDATA53_S43C6_POSITION                 equ 0003h
LCDDATA53_S43C6_SIZE                     equ 0001h
LCDDATA53_S43C6_LENGTH                   equ 0001h
LCDDATA53_S43C6_MASK                     equ 0008h
LCDDATA53_S44C6_POSN                     equ 0004h
LCDDATA53_S44C6_POSITION                 equ 0004h
LCDDATA53_S44C6_SIZE                     equ 0001h
LCDDATA53_S44C6_LENGTH                   equ 0001h
LCDDATA53_S44C6_MASK                     equ 0010h
LCDDATA53_S45C6_POSN                     equ 0005h
LCDDATA53_S45C6_POSITION                 equ 0005h
LCDDATA53_S45C6_SIZE                     equ 0001h
LCDDATA53_S45C6_LENGTH                   equ 0001h
LCDDATA53_S45C6_MASK                     equ 0020h
LCDDATA53_S46C6_POSN                     equ 0006h
LCDDATA53_S46C6_POSITION                 equ 0006h
LCDDATA53_S46C6_SIZE                     equ 0001h
LCDDATA53_S46C6_LENGTH                   equ 0001h
LCDDATA53_S46C6_MASK                     equ 0040h
LCDDATA53_S47C6_POSN                     equ 0007h
LCDDATA53_S47C6_POSITION                 equ 0007h
LCDDATA53_S47C6_SIZE                     equ 0001h
LCDDATA53_S47C6_LENGTH                   equ 0001h
LCDDATA53_S47C6_MASK                     equ 0080h

// Register: LCDDATA54
#define LCDDATA54 LCDDATA54
LCDDATA54                                equ 0EC4h
// bitfield definitions
LCDDATA54_S48C6_POSN                     equ 0000h
LCDDATA54_S48C6_POSITION                 equ 0000h
LCDDATA54_S48C6_SIZE                     equ 0001h
LCDDATA54_S48C6_LENGTH                   equ 0001h
LCDDATA54_S48C6_MASK                     equ 0001h
LCDDATA54_S49C6_POSN                     equ 0001h
LCDDATA54_S49C6_POSITION                 equ 0001h
LCDDATA54_S49C6_SIZE                     equ 0001h
LCDDATA54_S49C6_LENGTH                   equ 0001h
LCDDATA54_S49C6_MASK                     equ 0002h
LCDDATA54_S50C6_POSN                     equ 0002h
LCDDATA54_S50C6_POSITION                 equ 0002h
LCDDATA54_S50C6_SIZE                     equ 0001h
LCDDATA54_S50C6_LENGTH                   equ 0001h
LCDDATA54_S50C6_MASK                     equ 0004h
LCDDATA54_S51C6_POSN                     equ 0003h
LCDDATA54_S51C6_POSITION                 equ 0003h
LCDDATA54_S51C6_SIZE                     equ 0001h
LCDDATA54_S51C6_LENGTH                   equ 0001h
LCDDATA54_S51C6_MASK                     equ 0008h
LCDDATA54_S52C6_POSN                     equ 0004h
LCDDATA54_S52C6_POSITION                 equ 0004h
LCDDATA54_S52C6_SIZE                     equ 0001h
LCDDATA54_S52C6_LENGTH                   equ 0001h
LCDDATA54_S52C6_MASK                     equ 0010h
LCDDATA54_S53C6_POSN                     equ 0005h
LCDDATA54_S53C6_POSITION                 equ 0005h
LCDDATA54_S53C6_SIZE                     equ 0001h
LCDDATA54_S53C6_LENGTH                   equ 0001h
LCDDATA54_S53C6_MASK                     equ 0020h
LCDDATA54_S54C6_POSN                     equ 0006h
LCDDATA54_S54C6_POSITION                 equ 0006h
LCDDATA54_S54C6_SIZE                     equ 0001h
LCDDATA54_S54C6_LENGTH                   equ 0001h
LCDDATA54_S54C6_MASK                     equ 0040h
LCDDATA54_S55C6_POSN                     equ 0007h
LCDDATA54_S55C6_POSITION                 equ 0007h
LCDDATA54_S55C6_SIZE                     equ 0001h
LCDDATA54_S55C6_LENGTH                   equ 0001h
LCDDATA54_S55C6_MASK                     equ 0080h

