GopalSaraf/Practicals/PSDL/include/proc/pic18f86j99.inc
// Register: PADCFG1
#define PADCFG1 PADCFG1
PADCFG1                                  equ 0F54h
// bitfield definitions
PADCFG1_RLPU_POSN                        equ 0000h
PADCFG1_RLPU_POSITION                    equ 0000h
PADCFG1_RLPU_SIZE                        equ 0001h
PADCFG1_RLPU_LENGTH                      equ 0001h
PADCFG1_RLPU_MASK                        equ 0001h
PADCFG1_RKPU_POSN                        equ 0001h
PADCFG1_RKPU_POSITION                    equ 0001h
PADCFG1_RKPU_SIZE                        equ 0001h
PADCFG1_RKPU_LENGTH                      equ 0001h
PADCFG1_RKPU_MASK                        equ 0002h
PADCFG1_RJPU_POSN                        equ 0002h
PADCFG1_RJPU_POSITION                    equ 0002h
PADCFG1_RJPU_SIZE                        equ 0001h
PADCFG1_RJPU_LENGTH                      equ 0001h
PADCFG1_RJPU_MASK                        equ 0004h
PADCFG1_RHPU_POSN                        equ 0003h
PADCFG1_RHPU_POSITION                    equ 0003h
PADCFG1_RHPU_SIZE                        equ 0001h
PADCFG1_RHPU_LENGTH                      equ 0001h
PADCFG1_RHPU_MASK                        equ 0008h
PADCFG1_RGPU_POSN                        equ 0004h
PADCFG1_RGPU_POSITION                    equ 0004h
PADCFG1_RGPU_SIZE                        equ 0001h
PADCFG1_RGPU_LENGTH                      equ 0001h
PADCFG1_RGPU_MASK                        equ 0010h
PADCFG1_RFPU_POSN                        equ 0005h
PADCFG1_RFPU_POSITION                    equ 0005h
PADCFG1_RFPU_SIZE                        equ 0001h
PADCFG1_RFPU_LENGTH                      equ 0001h
PADCFG1_RFPU_MASK                        equ 0020h
PADCFG1_REPU_POSN                        equ 0006h
PADCFG1_REPU_POSITION                    equ 0006h
PADCFG1_REPU_SIZE                        equ 0001h
PADCFG1_REPU_LENGTH                      equ 0001h
PADCFG1_REPU_MASK                        equ 0040h
PADCFG1_RDPU_POSN                        equ 0007h
PADCFG1_RDPU_POSITION                    equ 0007h
PADCFG1_RDPU_SIZE                        equ 0001h
PADCFG1_RDPU_LENGTH                      equ 0001h
PADCFG1_RDPU_MASK                        equ 0080h
PADCFG1_PMPTTL_POSN                      equ 0000h
PADCFG1_PMPTTL_POSITION                  equ 0000h
PADCFG1_PMPTTL_SIZE                      equ 0001h
PADCFG1_PMPTTL_LENGTH                    equ 0001h
PADCFG1_PMPTTL_MASK                      equ 0001h

// Register: IOCN
#define IOCN IOCN
IOCN                                     equ 0F55h
// bitfield definitions
IOCN_IOCN0_POSN                          equ 0000h
IOCN_IOCN0_POSITION                      equ 0000h
IOCN_IOCN0_SIZE                          equ 0001h
IOCN_IOCN0_LENGTH                        equ 0001h
IOCN_IOCN0_MASK                          equ 0001h
IOCN_IOCN1_POSN                          equ 0001h
IOCN_IOCN1_POSITION                      equ 0001h
IOCN_IOCN1_SIZE                          equ 0001h
IOCN_IOCN1_LENGTH                        equ 0001h
IOCN_IOCN1_MASK                          equ 0002h
IOCN_IOCN2_POSN                          equ 0002h
IOCN_IOCN2_POSITION                      equ 0002h
IOCN_IOCN2_SIZE                          equ 0001h
IOCN_IOCN2_LENGTH                        equ 0001h
IOCN_IOCN2_MASK                          equ 0004h
IOCN_IOCN3_POSN                          equ 0003h
IOCN_IOCN3_POSITION                      equ 0003h
IOCN_IOCN3_SIZE                          equ 0001h
IOCN_IOCN3_LENGTH                        equ 0001h
IOCN_IOCN3_MASK                          equ 0008h
IOCN_IOCN4_POSN                          equ 0004h
IOCN_IOCN4_POSITION                      equ 0004h
IOCN_IOCN4_SIZE                          equ 0001h
IOCN_IOCN4_LENGTH                        equ 0001h
IOCN_IOCN4_MASK                          equ 0010h
IOCN_IOCN5_POSN                          equ 0005h
IOCN_IOCN5_POSITION                      equ 0005h
IOCN_IOCN5_SIZE                          equ 0001h
IOCN_IOCN5_LENGTH                        equ 0001h
IOCN_IOCN5_MASK                          equ 0020h
IOCN_IOCN6_POSN                          equ 0006h
IOCN_IOCN6_POSITION                      equ 0006h
IOCN_IOCN6_SIZE                          equ 0001h
IOCN_IOCN6_LENGTH                        equ 0001h
IOCN_IOCN6_MASK                          equ 0040h
IOCN_IOCN7_POSN                          equ 0007h
IOCN_IOCN7_POSITION                      equ 0007h
IOCN_IOCN7_SIZE                          equ 0001h
IOCN_IOCN7_LENGTH                        equ 0001h
IOCN_IOCN7_MASK                          equ 0080h

// Register: IOCP
#define IOCP IOCP
IOCP                                     equ 0F56h
// bitfield definitions
IOCP_IOCP0_POSN                          equ 0000h
IOCP_IOCP0_POSITION                      equ 0000h
IOCP_IOCP0_SIZE                          equ 0001h
IOCP_IOCP0_LENGTH                        equ 0001h
IOCP_IOCP0_MASK                          equ 0001h
IOCP_IOCP1_POSN                          equ 0001h
IOCP_IOCP1_POSITION                      equ 0001h
IOCP_IOCP1_SIZE                          equ 0001h
IOCP_IOCP1_LENGTH                        equ 0001h
IOCP_IOCP1_MASK                          equ 0002h
IOCP_IOCP2_POSN                          equ 0002h
IOCP_IOCP2_POSITION                      equ 0002h
IOCP_IOCP2_SIZE                          equ 0001h
IOCP_IOCP2_LENGTH                        equ 0001h
IOCP_IOCP2_MASK                          equ 0004h
IOCP_IOCP3_POSN                          equ 0003h
IOCP_IOCP3_POSITION                      equ 0003h
IOCP_IOCP3_SIZE                          equ 0001h
IOCP_IOCP3_LENGTH                        equ 0001h
IOCP_IOCP3_MASK                          equ 0008h
IOCP_IOCP4_POSN                          equ 0004h
IOCP_IOCP4_POSITION                      equ 0004h
IOCP_IOCP4_SIZE                          equ 0001h
IOCP_IOCP4_LENGTH                        equ 0001h
IOCP_IOCP4_MASK                          equ 0010h
IOCP_IOCP5_POSN                          equ 0005h
IOCP_IOCP5_POSITION                      equ 0005h
IOCP_IOCP5_SIZE                          equ 0001h
IOCP_IOCP5_LENGTH                        equ 0001h
IOCP_IOCP5_MASK                          equ 0020h
IOCP_IOCP6_POSN                          equ 0006h
IOCP_IOCP6_POSITION                      equ 0006h
IOCP_IOCP6_SIZE                          equ 0001h
IOCP_IOCP6_LENGTH                        equ 0001h
IOCP_IOCP6_MASK                          equ 0040h
IOCP_IOCP7_POSN                          equ 0007h
IOCP_IOCP7_POSITION                      equ 0007h
IOCP_IOCP7_SIZE                          equ 0001h
IOCP_IOCP7_LENGTH                        equ 0001h
IOCP_IOCP7_MASK                          equ 0080h

// Register: RTCCON2
#define RTCCON2 RTCCON2
RTCCON2                                  equ 0F57h
// bitfield definitions
RTCCON2_RTCSECSEL_POSN                   equ 0000h
RTCCON2_RTCSECSEL_POSITION               equ 0000h
RTCCON2_RTCSECSEL_SIZE                   equ 0002h
RTCCON2_RTCSECSEL_LENGTH                 equ 0002h
RTCCON2_RTCSECSEL_MASK                   equ 0003h
RTCCON2_RTCCLKSEL_POSN                   equ 0002h
RTCCON2_RTCCLKSEL_POSITION               equ 0002h
RTCCON2_RTCCLKSEL_SIZE                   equ 0002h
RTCCON2_RTCCLKSEL_LENGTH                 equ 0002h
RTCCON2_RTCCLKSEL_MASK                   equ 000Ch
RTCCON2_PWCSPRE_POSN                     equ 0004h
RTCCON2_PWCSPRE_POSITION                 equ 0004h
RTCCON2_PWCSPRE_SIZE                     equ 0001h
RTCCON2_PWCSPRE_LENGTH                   equ 0001h
RTCCON2_PWCSPRE_MASK                     equ 0010h
RTCCON2_PWCCPRE_POSN                     equ 0005h
RTCCON2_PWCCPRE_POSITION                 equ 0005h
RTCCON2_PWCCPRE_SIZE                     equ 0001h
RTCCON2_PWCCPRE_LENGTH                   equ 0001h
RTCCON2_PWCCPRE_MASK                     equ 0020h
RTCCON2_PWCPOL_POSN                      equ 0006h
RTCCON2_PWCPOL_POSITION                  equ 0006h
RTCCON2_PWCPOL_SIZE                      equ 0001h
RTCCON2_PWCPOL_LENGTH                    equ 0001h
RTCCON2_PWCPOL_MASK                      equ 0040h
RTCCON2_PWCEN_POSN                       equ 0007h
RTCCON2_PWCEN_POSITION                   equ 0007h
RTCCON2_PWCEN_SIZE                       equ 0001h
RTCCON2_PWCEN_LENGTH                     equ 0001h
RTCCON2_PWCEN_MASK                       equ 0080h
RTCCON2_RTCSECSEL0_POSN                  equ 0000h
RTCCON2_RTCSECSEL0_POSITION              equ 0000h
RTCCON2_RTCSECSEL0_SIZE                  equ 0001h
RTCCON2_RTCSECSEL0_LENGTH                equ 0001h
RTCCON2_RTCSECSEL0_MASK                  equ 0001h
RTCCON2_RTCSECSEL1_POSN                  equ 0001h
RTCCON2_RTCSECSEL1_POSITION              equ 0001h
RTCCON2_RTCSECSEL1_SIZE                  equ 0001h
RTCCON2_RTCSECSEL1_LENGTH                equ 0001h
RTCCON2_RTCSECSEL1_MASK                  equ 0002h
RTCCON2_RTCCLKSEL0_POSN                  equ 0002h
RTCCON2_RTCCLKSEL0_POSITION              equ 0002h
RTCCON2_RTCCLKSEL0_SIZE                  equ 0001h
RTCCON2_RTCCLKSEL0_LENGTH                equ 0001h
RTCCON2_RTCCLKSEL0_MASK                  equ 0004h
RTCCON2_RTCCLKSEL1_POSN                  equ 0003h
RTCCON2_RTCCLKSEL1_POSITION              equ 0003h
RTCCON2_RTCCLKSEL1_SIZE                  equ 0001h
RTCCON2_RTCCLKSEL1_LENGTH                equ 0001h
RTCCON2_RTCCLKSEL1_MASK                  equ 0008h

// Register: ALRMVALL
#define ALRMVALL ALRMVALL
ALRMVALL                                 equ 0F58h
// bitfield definitions
ALRMVALL_ALRMVALL_POSN                   equ 0000h
ALRMVALL_ALRMVALL_POSITION               equ 0000h
ALRMVALL_ALRMVALL_SIZE                   equ 0008h
ALRMVALL_ALRMVALL_LENGTH                 equ 0008h
ALRMVALL_ALRMVALL_MASK                   equ 00FFh

