GopalSaraf/Practicals/PSDL/include/proc/pic18f86j99.inc
// Register: PIE3
#define PIE3 PIE3
PIE3                                     equ 0FA3h
// bitfield definitions
PIE3_RTCCIE_POSN                         equ 0000h
PIE3_RTCCIE_POSITION                     equ 0000h
PIE3_RTCCIE_SIZE                         equ 0001h
PIE3_RTCCIE_LENGTH                       equ 0001h
PIE3_RTCCIE_MASK                         equ 0001h
PIE3_CCP1IE_POSN                         equ 0001h
PIE3_CCP1IE_POSITION                     equ 0001h
PIE3_CCP1IE_SIZE                         equ 0001h
PIE3_CCP1IE_LENGTH                       equ 0001h
PIE3_CCP1IE_MASK                         equ 0002h
PIE3_CCP2IE_POSN                         equ 0002h
PIE3_CCP2IE_POSITION                     equ 0002h
PIE3_CCP2IE_SIZE                         equ 0001h
PIE3_CCP2IE_LENGTH                       equ 0001h
PIE3_CCP2IE_MASK                         equ 0004h
PIE3_CTMUIE_POSN                         equ 0003h
PIE3_CTMUIE_POSITION                     equ 0003h
PIE3_CTMUIE_SIZE                         equ 0001h
PIE3_CTMUIE_LENGTH                       equ 0001h
PIE3_CTMUIE_MASK                         equ 0008h
PIE3_TX2IE_POSN                          equ 0004h
PIE3_TX2IE_POSITION                      equ 0004h
PIE3_TX2IE_SIZE                          equ 0001h
PIE3_TX2IE_LENGTH                        equ 0001h
PIE3_TX2IE_MASK                          equ 0010h
PIE3_RC2IE_POSN                          equ 0005h
PIE3_RC2IE_POSITION                      equ 0005h
PIE3_RC2IE_SIZE                          equ 0001h
PIE3_RC2IE_LENGTH                        equ 0001h
PIE3_RC2IE_MASK                          equ 0020h
PIE3_LCDIE_POSN                          equ 0006h
PIE3_LCDIE_POSITION                      equ 0006h
PIE3_LCDIE_SIZE                          equ 0001h
PIE3_LCDIE_LENGTH                        equ 0001h
PIE3_LCDIE_MASK                          equ 0040h
PIE3_TMR5GIE_POSN                        equ 0007h
PIE3_TMR5GIE_POSITION                    equ 0007h
PIE3_TMR5GIE_SIZE                        equ 0001h
PIE3_TMR5GIE_LENGTH                      equ 0001h
PIE3_TMR5GIE_MASK                        equ 0080h
PIE3_RXB0IE_POSN                         equ 0000h
PIE3_RXB0IE_POSITION                     equ 0000h
PIE3_RXB0IE_SIZE                         equ 0001h
PIE3_RXB0IE_LENGTH                       equ 0001h
PIE3_RXB0IE_MASK                         equ 0001h
PIE3_RXB1IE_POSN                         equ 0001h
PIE3_RXB1IE_POSITION                     equ 0001h
PIE3_RXB1IE_SIZE                         equ 0001h
PIE3_RXB1IE_LENGTH                       equ 0001h
PIE3_RXB1IE_MASK                         equ 0002h
PIE3_TXB0IE_POSN                         equ 0002h
PIE3_TXB0IE_POSITION                     equ 0002h
PIE3_TXB0IE_SIZE                         equ 0001h
PIE3_TXB0IE_LENGTH                       equ 0001h
PIE3_TXB0IE_MASK                         equ 0004h
PIE3_TXB1IE_POSN                         equ 0003h
PIE3_TXB1IE_POSITION                     equ 0003h
PIE3_TXB1IE_SIZE                         equ 0001h
PIE3_TXB1IE_LENGTH                       equ 0001h
PIE3_TXB1IE_MASK                         equ 0008h
PIE3_TXB2IE_POSN                         equ 0004h
PIE3_TXB2IE_POSITION                     equ 0004h
PIE3_TXB2IE_SIZE                         equ 0001h
PIE3_TXB2IE_LENGTH                       equ 0001h
PIE3_TXB2IE_MASK                         equ 0010h
PIE3_RXBNIE_POSN                         equ 0001h
PIE3_RXBNIE_POSITION                     equ 0001h
PIE3_RXBNIE_SIZE                         equ 0001h
PIE3_RXBNIE_LENGTH                       equ 0001h
PIE3_RXBNIE_MASK                         equ 0002h
PIE3_TXBNIE_POSN                         equ 0004h
PIE3_TXBNIE_POSITION                     equ 0004h
PIE3_TXBNIE_SIZE                         equ 0001h
PIE3_TXBNIE_LENGTH                       equ 0001h
PIE3_TXBNIE_MASK                         equ 0010h

// Register: PIR3
#define PIR3 PIR3
PIR3                                     equ 0FA4h
// bitfield definitions
PIR3_RTCCIF_POSN                         equ 0000h
PIR3_RTCCIF_POSITION                     equ 0000h
PIR3_RTCCIF_SIZE                         equ 0001h
PIR3_RTCCIF_LENGTH                       equ 0001h
PIR3_RTCCIF_MASK                         equ 0001h
PIR3_CCP1IF_POSN                         equ 0001h
PIR3_CCP1IF_POSITION                     equ 0001h
PIR3_CCP1IF_SIZE                         equ 0001h
PIR3_CCP1IF_LENGTH                       equ 0001h
PIR3_CCP1IF_MASK                         equ 0002h
PIR3_CCP2IF_POSN                         equ 0002h
PIR3_CCP2IF_POSITION                     equ 0002h
PIR3_CCP2IF_SIZE                         equ 0001h
PIR3_CCP2IF_LENGTH                       equ 0001h
PIR3_CCP2IF_MASK                         equ 0004h
PIR3_CTMUIF_POSN                         equ 0003h
PIR3_CTMUIF_POSITION                     equ 0003h
PIR3_CTMUIF_SIZE                         equ 0001h
PIR3_CTMUIF_LENGTH                       equ 0001h
PIR3_CTMUIF_MASK                         equ 0008h
PIR3_TX2IF_POSN                          equ 0004h
PIR3_TX2IF_POSITION                      equ 0004h
PIR3_TX2IF_SIZE                          equ 0001h
PIR3_TX2IF_LENGTH                        equ 0001h
PIR3_TX2IF_MASK                          equ 0010h
PIR3_RC2IF_POSN                          equ 0005h
PIR3_RC2IF_POSITION                      equ 0005h
PIR3_RC2IF_SIZE                          equ 0001h
PIR3_RC2IF_LENGTH                        equ 0001h
PIR3_RC2IF_MASK                          equ 0020h
PIR3_LCDIF_POSN                          equ 0006h
PIR3_LCDIF_POSITION                      equ 0006h
PIR3_LCDIF_SIZE                          equ 0001h
PIR3_LCDIF_LENGTH                        equ 0001h
PIR3_LCDIF_MASK                          equ 0040h
PIR3_TMR5GIF_POSN                        equ 0007h
PIR3_TMR5GIF_POSITION                    equ 0007h
PIR3_TMR5GIF_SIZE                        equ 0001h
PIR3_TMR5GIF_LENGTH                      equ 0001h
PIR3_TMR5GIF_MASK                        equ 0080h
PIR3_RXBNIF_POSN                         equ 0001h
PIR3_RXBNIF_POSITION                     equ 0001h
PIR3_RXBNIF_SIZE                         equ 0001h
PIR3_RXBNIF_LENGTH                       equ 0001h
PIR3_RXBNIF_MASK                         equ 0002h
PIR3_TXBNIF_POSN                         equ 0004h
PIR3_TXBNIF_POSITION                     equ 0004h
PIR3_TXBNIF_SIZE                         equ 0001h
PIR3_TXBNIF_LENGTH                       equ 0001h
PIR3_TXBNIF_MASK                         equ 0010h

// Register: IPR3
#define IPR3 IPR3
IPR3                                     equ 0FA5h
// bitfield definitions
IPR3_RTCCIP_POSN                         equ 0000h
IPR3_RTCCIP_POSITION                     equ 0000h
IPR3_RTCCIP_SIZE                         equ 0001h
IPR3_RTCCIP_LENGTH                       equ 0001h
IPR3_RTCCIP_MASK                         equ 0001h
IPR3_CCP1IP_POSN                         equ 0001h
IPR3_CCP1IP_POSITION                     equ 0001h
IPR3_CCP1IP_SIZE                         equ 0001h
IPR3_CCP1IP_LENGTH                       equ 0001h
IPR3_CCP1IP_MASK                         equ 0002h
IPR3_CCP2IP_POSN                         equ 0002h
IPR3_CCP2IP_POSITION                     equ 0002h
IPR3_CCP2IP_SIZE                         equ 0001h
IPR3_CCP2IP_LENGTH                       equ 0001h
IPR3_CCP2IP_MASK                         equ 0004h
IPR3_CTMUIP_POSN                         equ 0003h
IPR3_CTMUIP_POSITION                     equ 0003h
IPR3_CTMUIP_SIZE                         equ 0001h
IPR3_CTMUIP_LENGTH                       equ 0001h
IPR3_CTMUIP_MASK                         equ 0008h
IPR3_TX2IP_POSN                          equ 0004h
IPR3_TX2IP_POSITION                      equ 0004h
IPR3_TX2IP_SIZE                          equ 0001h
IPR3_TX2IP_LENGTH                        equ 0001h
IPR3_TX2IP_MASK                          equ 0010h
IPR3_RC2IP_POSN                          equ 0005h
IPR3_RC2IP_POSITION                      equ 0005h
IPR3_RC2IP_SIZE                          equ 0001h
IPR3_RC2IP_LENGTH                        equ 0001h
IPR3_RC2IP_MASK                          equ 0020h
IPR3_LCDIP_POSN                          equ 0006h
IPR3_LCDIP_POSITION                      equ 0006h
IPR3_LCDIP_SIZE                          equ 0001h
IPR3_LCDIP_LENGTH                        equ 0001h
IPR3_LCDIP_MASK                          equ 0040h
IPR3_TMR5GIP_POSN                        equ 0007h
IPR3_TMR5GIP_POSITION                    equ 0007h
IPR3_TMR5GIP_SIZE                        equ 0001h
IPR3_TMR5GIP_LENGTH                      equ 0001h
IPR3_TMR5GIP_MASK                        equ 0080h
IPR3_RXBNIP_POSN                         equ 0001h
IPR3_RXBNIP_POSITION                     equ 0001h
IPR3_RXBNIP_SIZE                         equ 0001h
IPR3_RXBNIP_LENGTH                       equ 0001h
IPR3_RXBNIP_MASK                         equ 0002h
IPR3_TXBNIP_POSN                         equ 0004h
IPR3_TXBNIP_POSITION                     equ 0004h
IPR3_TXBNIP_SIZE                         equ 0001h
IPR3_TXBNIP_LENGTH                       equ 0001h
IPR3_TXBNIP_MASK                         equ 0010h

// Register: PIR6
#define PIR6 PIR6
PIR6                                     equ 0FA6h
// bitfield definitions
PIR6_CMP1IF_POSN                         equ 0000h
PIR6_CMP1IF_POSITION                     equ 0000h
PIR6_CMP1IF_SIZE                         equ 0001h
PIR6_CMP1IF_LENGTH                       equ 0001h
PIR6_CMP1IF_MASK                         equ 0001h
PIR6_CMP2IF_POSN                         equ 0001h
PIR6_CMP2IF_POSITION                     equ 0001h
PIR6_CMP2IF_SIZE                         equ 0001h
PIR6_CMP2IF_LENGTH                       equ 0001h
PIR6_CMP2IF_MASK                         equ 0002h
PIR6_CMP3IF_POSN                         equ 0002h
PIR6_CMP3IF_POSITION                     equ 0002h
PIR6_CMP3IF_SIZE                         equ 0001h
PIR6_CMP3IF_LENGTH                       equ 0001h
PIR6_CMP3IF_MASK                         equ 0004h
PIR6_TX3IF_POSN                          equ 0004h
PIR6_TX3IF_POSITION                      equ 0004h
PIR6_TX3IF_SIZE                          equ 0001h
PIR6_TX3IF_LENGTH                        equ 0001h
PIR6_TX3IF_MASK                          equ 0010h
PIR6_RC3IF_POSN                          equ 0005h
PIR6_RC3IF_POSITION                      equ 0005h
PIR6_RC3IF_SIZE                          equ 0001h
PIR6_RC3IF_LENGTH                        equ 0001h
PIR6_RC3IF_MASK                          equ 0020h
PIR6_TX4IF_POSN                          equ 0006h
PIR6_TX4IF_POSITION                      equ 0006h
PIR6_TX4IF_SIZE                          equ 0001h
PIR6_TX4IF_LENGTH                        equ 0001h
PIR6_TX4IF_MASK                          equ 0040h
PIR6_RC4IF_POSN                          equ 0007h
PIR6_RC4IF_POSITION                      equ 0007h
PIR6_RC4IF_SIZE                          equ 0001h
PIR6_RC4IF_LENGTH                        equ 0001h
PIR6_RC4IF_MASK                          equ 0080h

// Register: PSPCON
#define PSPCON PSPCON
PSPCON                                   equ 0FA7h
// bitfield definitions
PSPCON_PSPMODE_POSN                      equ 0004h
PSPCON_PSPMODE_POSITION                  equ 0004h
PSPCON_PSPMODE_SIZE                      equ 0001h
PSPCON_PSPMODE_LENGTH                    equ 0001h
PSPCON_PSPMODE_MASK                      equ 0010h
PSPCON_IBOV_POSN                         equ 0005h
PSPCON_IBOV_POSITION                     equ 0005h
PSPCON_IBOV_SIZE                         equ 0001h
PSPCON_IBOV_LENGTH                       equ 0001h
PSPCON_IBOV_MASK                         equ 0020h
PSPCON_OBF_POSN                          equ 0006h
PSPCON_OBF_POSITION                      equ 0006h
PSPCON_OBF_SIZE                          equ 0001h
PSPCON_OBF_LENGTH                        equ 0001h
PSPCON_OBF_MASK                          equ 0040h
PSPCON_IBF_POSN                          equ 0007h
PSPCON_IBF_POSITION                      equ 0007h
PSPCON_IBF_SIZE                          equ 0001h
PSPCON_IBF_LENGTH                        equ 0001h
PSPCON_IBF_MASK                          equ 0080h

// Register: HLVDCON
#define HLVDCON HLVDCON
HLVDCON                                  equ 0FA8h
// bitfield definitions
HLVDCON_HLVDL_POSN                       equ 0000h
HLVDCON_HLVDL_POSITION                   equ 0000h
HLVDCON_HLVDL_SIZE                       equ 0004h
HLVDCON_HLVDL_LENGTH                     equ 0004h
HLVDCON_HLVDL_MASK                       equ 000Fh
HLVDCON_HLVDEN_POSN                      equ 0004h
HLVDCON_HLVDEN_POSITION                  equ 0004h
HLVDCON_HLVDEN_SIZE                      equ 0001h
HLVDCON_HLVDEN_LENGTH                    equ 0001h
HLVDCON_HLVDEN_MASK                      equ 0010h
HLVDCON_IRVST_POSN                       equ 0005h
HLVDCON_IRVST_POSITION                   equ 0005h
HLVDCON_IRVST_SIZE                       equ 0001h
HLVDCON_IRVST_LENGTH                     equ 0001h
HLVDCON_IRVST_MASK                       equ 0020h
HLVDCON_BGVST_POSN                       equ 0006h
HLVDCON_BGVST_POSITION                   equ 0006h
HLVDCON_BGVST_SIZE                       equ 0001h
HLVDCON_BGVST_LENGTH                     equ 0001h
HLVDCON_BGVST_MASK                       equ 0040h
HLVDCON_VDIRMAG_POSN                     equ 0007h
HLVDCON_VDIRMAG_POSITION                 equ 0007h
HLVDCON_VDIRMAG_SIZE                     equ 0001h
HLVDCON_VDIRMAG_LENGTH                   equ 0001h
HLVDCON_VDIRMAG_MASK                     equ 0080h
HLVDCON_HLVDL0_POSN                      equ 0000h
HLVDCON_HLVDL0_POSITION                  equ 0000h
HLVDCON_HLVDL0_SIZE                      equ 0001h
HLVDCON_HLVDL0_LENGTH                    equ 0001h
HLVDCON_HLVDL0_MASK                      equ 0001h
HLVDCON_HLVDL1_POSN                      equ 0001h
HLVDCON_HLVDL1_POSITION                  equ 0001h
HLVDCON_HLVDL1_SIZE                      equ 0001h
HLVDCON_HLVDL1_LENGTH                    equ 0001h
HLVDCON_HLVDL1_MASK                      equ 0002h
HLVDCON_HLVDL2_POSN                      equ 0002h
HLVDCON_HLVDL2_POSITION                  equ 0002h
HLVDCON_HLVDL2_SIZE                      equ 0001h
HLVDCON_HLVDL2_LENGTH                    equ 0001h
HLVDCON_HLVDL2_MASK                      equ 0004h
HLVDCON_HLVDL3_POSN                      equ 0003h
HLVDCON_HLVDL3_POSITION                  equ 0003h
HLVDCON_HLVDL3_SIZE                      equ 0001h
HLVDCON_HLVDL3_LENGTH                    equ 0001h
HLVDCON_HLVDL3_MASK                      equ 0008h

