GopalSaraf/Practicals/PSDL/include/proc/pic18f86j99.inc
// Register: PCL
#define PCL PCL
PCL                                      equ 0FF9h
// bitfield definitions
PCL_PCL_POSN                             equ 0000h
PCL_PCL_POSITION                         equ 0000h
PCL_PCL_SIZE                             equ 0008h
PCL_PCL_LENGTH                           equ 0008h
PCL_PCL_MASK                             equ 00FFh

// Register: PCLATH
#define PCLATH PCLATH
PCLATH                                   equ 0FFAh
// bitfield definitions
PCLATH_PCH_POSN                          equ 0000h
PCLATH_PCH_POSITION                      equ 0000h
PCLATH_PCH_SIZE                          equ 0008h
PCLATH_PCH_LENGTH                        equ 0008h
PCLATH_PCH_MASK                          equ 00FFh

// Register: PCLATU
#define PCLATU PCLATU
PCLATU                                   equ 0FFBh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 0FFCh
// bitfield definitions
STKPTR_STKPTR_POSN                       equ 0000h
STKPTR_STKPTR_POSITION                   equ 0000h
STKPTR_STKPTR_SIZE                       equ 0005h
STKPTR_STKPTR_LENGTH                     equ 0005h
STKPTR_STKPTR_MASK                       equ 001Fh
STKPTR_STKUNF_POSN                       equ 0006h
STKPTR_STKUNF_POSITION                   equ 0006h
STKPTR_STKUNF_SIZE                       equ 0001h
STKPTR_STKUNF_LENGTH                     equ 0001h
STKPTR_STKUNF_MASK                       equ 0040h
STKPTR_STKFUL_POSN                       equ 0007h
STKPTR_STKFUL_POSITION                   equ 0007h
STKPTR_STKFUL_SIZE                       equ 0001h
STKPTR_STKFUL_LENGTH                     equ 0001h
STKPTR_STKFUL_MASK                       equ 0080h
STKPTR_SP0_POSN                          equ 0000h
STKPTR_SP0_POSITION                      equ 0000h
STKPTR_SP0_SIZE                          equ 0001h
STKPTR_SP0_LENGTH                        equ 0001h
STKPTR_SP0_MASK                          equ 0001h
STKPTR_SP1_POSN                          equ 0001h
STKPTR_SP1_POSITION                      equ 0001h
STKPTR_SP1_SIZE                          equ 0001h
STKPTR_SP1_LENGTH                        equ 0001h
STKPTR_SP1_MASK                          equ 0002h
STKPTR_SP2_POSN                          equ 0002h
STKPTR_SP2_POSITION                      equ 0002h
STKPTR_SP2_SIZE                          equ 0001h
STKPTR_SP2_LENGTH                        equ 0001h
STKPTR_SP2_MASK                          equ 0004h
STKPTR_SP3_POSN                          equ 0003h
STKPTR_SP3_POSITION                      equ 0003h
STKPTR_SP3_SIZE                          equ 0001h
STKPTR_SP3_LENGTH                        equ 0001h
STKPTR_SP3_MASK                          equ 0008h
STKPTR_SP4_POSN                          equ 0004h
STKPTR_SP4_POSITION                      equ 0004h
STKPTR_SP4_SIZE                          equ 0001h
STKPTR_SP4_LENGTH                        equ 0001h
STKPTR_SP4_MASK                          equ 0010h
STKPTR_STKOVF_POSN                       equ 0007h
STKPTR_STKOVF_POSITION                   equ 0007h
STKPTR_STKOVF_SIZE                       equ 0001h
STKPTR_STKOVF_LENGTH                     equ 0001h
STKPTR_STKOVF_MASK                       equ 0080h

// Register: TOS
#define TOS TOS
TOS                                      equ 0FFDh

// Register: TOSL
#define TOSL TOSL
TOSL                                     equ 0FFDh
// bitfield definitions
TOSL_TOSL_POSN                           equ 0000h
TOSL_TOSL_POSITION                       equ 0000h
TOSL_TOSL_SIZE                           equ 0008h
TOSL_TOSL_LENGTH                         equ 0008h
TOSL_TOSL_MASK                           equ 00FFh

// Register: TOSH
#define TOSH TOSH
TOSH                                     equ 0FFEh
// bitfield definitions
TOSH_TOSH_POSN                           equ 0000h
TOSH_TOSH_POSITION                       equ 0000h
TOSH_TOSH_SIZE                           equ 0008h
TOSH_TOSH_LENGTH                         equ 0008h
TOSH_TOSH_MASK                           equ 00FFh

// Register: TOSU
#define TOSU TOSU
TOSU                                     equ 0FFFh

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 0FFFFFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 0FFh)
#endif
#define ABDEN1                           BANKMASK(BAUDCON1), 0, a
#define ABDEN2                           BANKMASK(BAUDCON2), 0, b
#define ABDEN3                           BANKMASK(BAUDCON3), 0, b
#define ABDEN4                           BANKMASK(BAUDCON4), 0, b
#define ABDOVF1                          BANKMASK(BAUDCON1), 7, a
#define ABDOVF2                          BANKMASK(BAUDCON2), 7, b
#define ABDOVF3                          BANKMASK(BAUDCON3), 7, b
#define ABDOVF4                          BANKMASK(BAUDCON4), 7, b
#define ACKDT1                           BANKMASK(SSP1CON2), 5, a
#define ACKDT2                           BANKMASK(SSP2CON2), 5, b
#define ACKEN1                           BANKMASK(SSP1CON2), 4, a
#define ACKEN2                           BANKMASK(SSP2CON2), 4, b
#define ACKSTAT1                         BANKMASK(SSP1CON2), 6, a
#define ACKSTAT2                         BANKMASK(SSP2CON2), 6, b
#define ACTEN                            BANKMASK(ACTCON), 7, a
#define ACTLOCK                          BANKMASK(ACTCON), 3, a
#define ACTLOCKIE                        BANKMASK(PIE5), 5, a
#define ACTLOCKIF                        BANKMASK(PIR5), 5, a
#define ACTLOCKIP                        BANKMASK(IPR5), 5, a
#define ACTLOCKPOL                       BANKMASK(ACTCON), 2, a
#define ACTORS                           BANKMASK(ACTCON), 1, a
#define ACTORSIE                         BANKMASK(PIE5), 6, a
#define ACTORSIF                         BANKMASK(PIR5), 6, a
#define ACTORSIP                         BANKMASK(IPR5), 6, a
#define ACTORSPOL                        BANKMASK(ACTCON), 0, a
#define ACTSIDL                          BANKMASK(ACTCON), 5, a
#define ACTSRC                           BANKMASK(ACTCON), 4, a
#define ACTVIE                           BANKMASK(UIE), 2, b
#define ACTVIF                           BANKMASK(UIR), 2, a
#define ADCMD                            BANKMASK(PMD3), 5, b
#define ADCS0                            BANKMASK(ADCON3L), 0, b
#define ADCS1                            BANKMASK(ADCON3L), 1, b
#define ADCS2                            BANKMASK(ADCON3L), 2, b
#define ADCS3                            BANKMASK(ADCON3L), 3, b
#define ADCS4                            BANKMASK(ADCON3L), 4, b
#define ADCS5                            BANKMASK(ADCON3L), 5, b
#define ADCS6                            BANKMASK(ADCON3L), 6, b
#define ADCS7                            BANKMASK(ADCON3L), 7, b
#define ADDR0                            BANKMASK(UADDR), 0, a
#define ADDR1                            BANKMASK(UADDR), 1, a
#define ADDR2                            BANKMASK(UADDR), 2, a
#define ADDR3                            BANKMASK(UADDR), 3, a
#define ADDR4                            BANKMASK(UADDR), 4, a
#define ADDR5                            BANKMASK(UADDR), 5, a
#define ADDR6                            BANKMASK(UADDR), 6, a
#define ADEN                             BANKMASK(RCSTA1), 3, a
#define ADIE                             BANKMASK(PIE1), 6, a
#define ADIF                             BANKMASK(PIR1), 6, a
#define ADIP                             BANKMASK(IPR1), 6, a
#define ADMSK11                          BANKMASK(SSP1CON2), 1, a
#define ADMSK12                          BANKMASK(SSP2CON2), 1, b
#define ADMSK21                          BANKMASK(SSP1CON2), 2, a
#define ADMSK22                          BANKMASK(SSP2CON2), 2, b
#define ADMSK31                          BANKMASK(SSP1CON2), 3, a
#define ADMSK32                          BANKMASK(SSP2CON2), 3, b
#define ADMSK41                          BANKMASK(SSP1CON2), 4, a
#define ADMSK42                          BANKMASK(SSP2CON2), 4, b
#define ADMSK51                          BANKMASK(SSP1CON2), 5, a
#define ADMSK52                          BANKMASK(SSP2CON2), 5, b
#define ADON                             BANKMASK(ADCON1H), 7, a
#define ADRC                             BANKMASK(ADCON3H), 7, b
#define ALRMEN                           BANKMASK(ALRMCFG), 7, b
#define ALRMPTR0                         BANKMASK(ALRMCFG), 0, b
#define ALRMPTR1                         BANKMASK(ALRMCFG), 1, b
#define ALTS                             BANKMASK(ADCON2L), 0, b
#define AMASK0                           BANKMASK(ALRMCFG), 2, b
#define AMASK1                           BANKMASK(ALRMCFG), 3, b
#define AMASK2                           BANKMASK(ALRMCFG), 4, b
#define AMASK3                           BANKMASK(ALRMCFG), 5, b
#define ANSEL0                           BANKMASK(ANCON1), 0, b
#define ANSEL1                           BANKMASK(ANCON1), 1, b
#define ANSEL10                          BANKMASK(ANCON2), 2, b
#define ANSEL11                          BANKMASK(ANCON2), 3, b
#define ANSEL12                          BANKMASK(ANCON2), 4, b
#define ANSEL13                          BANKMASK(ANCON2), 5, b
#define ANSEL14                          BANKMASK(ANCON2), 6, b
#define ANSEL15                          BANKMASK(ANCON2), 7, b
#define ANSEL16                          BANKMASK(ANCON3), 0, b
#define ANSEL17                          BANKMASK(ANCON3), 1, b
#define ANSEL18                          BANKMASK(ANCON3), 2, b
#define ANSEL19                          BANKMASK(ANCON3), 3, b
#define ANSEL2                           BANKMASK(ANCON1), 2, b
#define ANSEL20                          BANKMASK(ANCON3), 4, b
#define ANSEL21                          BANKMASK(ANCON3), 5, b
#define ANSEL22                          BANKMASK(ANCON3), 6, b
#define ANSEL23                          BANKMASK(ANCON3), 7, b
#define ANSEL3                           BANKMASK(ANCON1), 3, b
#define ANSEL4                           BANKMASK(ANCON1), 4, b
#define ANSEL5                           BANKMASK(ANCON1), 5, b
#define ANSEL6                           BANKMASK(ANCON1), 6, b
#define ANSEL7                           BANKMASK(ANCON1), 7, b
#define ANSEL8                           BANKMASK(ANCON2), 0, b
#define ANSEL9                           BANKMASK(ANCON2), 1, b
#define ARPT0                            BANKMASK(ALRMRPT), 0, b
#define ARPT1                            BANKMASK(ALRMRPT), 1, b
#define ARPT2                            BANKMASK(ALRMRPT), 2, b
#define ARPT3                            BANKMASK(ALRMRPT), 3, b
#define ARPT4                            BANKMASK(ALRMRPT), 4, b
#define ARPT5                            BANKMASK(ALRMRPT), 5, b
#define ARPT6                            BANKMASK(ALRMRPT), 6, b
#define ARPT7                            BANKMASK(ALRMRPT), 7, b
#define ASAM                             BANKMASK(ADCON1L), 2, a
#define ASENA                            BANKMASK(ADCON5H), 7, b
#define ASINTMD0                         BANKMASK(ADCON5H), 0, b
#define ASINTMD1                         BANKMASK(ADCON5H), 1, b
#define BC0                              BANKMASK(DMABCL), 0, a
#define BC1                              BANKMASK(DMABCL), 1, a
#define BC2                              BANKMASK(DMABCL), 2, a
#define BC3                              BANKMASK(DMABCL), 3, a
#define BC4                              BANKMASK(DMABCL), 4, a
#define BC5                              BANKMASK(DMABCL), 5, a
#define BC6                              BANKMASK(DMABCL), 6, a
#define BC7                              BANKMASK(DMABCL), 7, a
#define BC8                              BANKMASK(DMABCH), 0, a
#define BC9                              BANKMASK(DMABCH), 1, a
#define BCL1IE                           BANKMASK(PIE2), 3, a
#define BCL1IF                           BANKMASK(PIR2), 3, a
#define BCL1IP                           BANKMASK(IPR2), 3, a
#define BCL2IE                           BANKMASK(PIE2), 5, a
#define BCL2IF                           BANKMASK(PIR2), 5, a
#define BCL2IP                           BANKMASK(IPR2), 5, a
#define BF1                              BANKMASK(SSP1STAT), 0, a
#define BF2                              BANKMASK(SSP2STAT), 0, b
#define BGVST                            BANKMASK(HLVDCON), 6, a
#define BIAS0                            BANKMASK(LCDREG), 3, b
#define BIAS1                            BANKMASK(LCDREG), 4, b
#define BIAS2                            BANKMASK(LCDREG), 5, b
#define BIASMD                           BANKMASK(LCDPS), 6, b
#define BRG161                           BANKMASK(BAUDCON1), 3, a
#define BRG162                           BANKMASK(BAUDCON2), 3, b
#define BRG163                           BANKMASK(BAUDCON3), 3, b
#define BRG164                           BANKMASK(BAUDCON4), 3, b
#define BRGH1                            BANKMASK(TXSTA1), 2, a
#define BTOEE                            BANKMASK(UEIE), 4, b
#define BTOEF                            BANKMASK(UEIR), 4, a
#define BTSEE                            BANKMASK(UEIE), 7, b
#define BTSEF                            BANKMASK(UEIR), 7, a
#define BUFM                             BANKMASK(ADCON2L), 1, b
#define BUFREGEN                         BANKMASK(ADCON2H), 3, b
#define BUFS                             BANKMASK(ADCON2L), 7, b
#define C10TSEL                          BANKMASK(CCPTMRS2), 4, b
#define C10TSEL0                         BANKMASK(CCPTMRS2), 4, b
#define C1CH0                            BANKMASK(CM1CON), 0, b
#define C1CH1                            BANKMASK(CM1CON), 1, b
#define C1OUT                            BANKMASK(CMSTAT), 0, a
#define C1OUTF                           BANKMASK(PORTF), 2, a
#define C1TSEL0                          BANKMASK(CCPTMRS0), 0, b
#define C1TSEL1                          BANKMASK(CCPTMRS0), 1, b
#define C1TSEL2                          BANKMASK(CCPTMRS0), 2, b
#define C2OUT                            BANKMASK(CMSTAT), 1, a
#define C2TSEL0                          BANKMASK(CCPTMRS0), 3, b
#define C2TSEL1                          BANKMASK(CCPTMRS0), 4, b
#define C2TSEL2                          BANKMASK(CCPTMRS0), 5, b
#define C3OUT                            BANKMASK(CMSTAT), 2, a
#define C3OUTG                           BANKMASK(PORTG), 1, a
#define C3TSEL0                          BANKMASK(CCPTMRS0), 6, b
#define C3TSEL1                          BANKMASK(CCPTMRS0), 7, b
#define C4TSEL0                          BANKMASK(CCPTMRS1), 0, b
#define C4TSEL1                          BANKMASK(CCPTMRS1), 1, b
#define C5TSEL                           BANKMASK(CCPTMRS1), 2, b
#define C5TSEL0                          BANKMASK(CCPTMRS1), 2, b
#define C6TSEL                           BANKMASK(CCPTMRS1), 4, b
#define C6TSEL0                          BANKMASK(CCPTMRS1), 4, b
#define C7TSEL0                          BANKMASK(CCPTMRS1), 6, b
#define C7TSEL1                          BANKMASK(CCPTMRS1), 7, b
#define C8TSEL0                          BANKMASK(CCPTMRS2), 0, b
#define C8TSEL1                          BANKMASK(CCPTMRS2), 1, b
#define C9TSEL                           BANKMASK(CCPTMRS2), 2, b
#define C9TSEL0                          BANKMASK(CCPTMRS2), 2, b
#define CAL0                             BANKMASK(RTCCAL), 0, b
#define CAL1                             BANKMASK(RTCCAL), 1, b
#define CAL2                             BANKMASK(RTCCAL), 2, b
#define CAL3                             BANKMASK(RTCCAL), 3, b
#define CAL4                             BANKMASK(RTCCAL), 4, b
#define CAL5                             BANKMASK(RTCCAL), 5, b
#define CAL6                             BANKMASK(RTCCAL), 6, b
#define CAL7                             BANKMASK(RTCCAL), 7, b
#define CARRY                            BANKMASK(STATUS), 0, a
#define CCH01                            BANKMASK(CM1CON), 0, b
#define CCH02                            BANKMASK(CM2CON), 0, b
#define CCH03                            BANKMASK(CM3CON), 0, b
#define CCH05                            BANKMASK(IPR5), 0, a
#define CCH11                            BANKMASK(CM1CON), 1, b
#define CCH12                            BANKMASK(CM2CON), 1, b
#define CCH13                            BANKMASK(CM3CON), 1, b
#define CCH15                            BANKMASK(IPR5), 1, a
#define CCIP3IP                          BANKMASK(IPR4), 0, a
#define CCP10                            BANKMASK(PORTE), 2, a
#define CCP10IE                          BANKMASK(PIE4), 7, a
#define CCP10IF                          BANKMASK(PIR4), 7, a
#define CCP10IP                          BANKMASK(IPR4), 7, a
#define CCP10M0                          BANKMASK(CCP10CON), 0, b
#define CCP10M1                          BANKMASK(CCP10CON), 1, b
#define CCP10M2                          BANKMASK(CCP10CON), 2, b
#define CCP10M3                          BANKMASK(CCP10CON), 3, b
#define CCP10MD                          BANKMASK(PMD0), 7, b
#define CCP10OD                          BANKMASK(ODCON2), 7, b
#define CCP10R0                          BANKMASK(RPINR38_39), 0, b
#define CCP10R1                          BANKMASK(RPINR38_39), 1, b
#define CCP10R2                          BANKMASK(RPINR38_39), 2, b
#define CCP10R3                          BANKMASK(RPINR38_39), 3, b
#define CCP10X                           BANKMASK(CCP10CON), 5, b
#define CCP10Y                           BANKMASK(CCP10CON), 4, b
#define CCP1IE                           BANKMASK(PIE3), 1, a
#define CCP1IF                           BANKMASK(PIR3), 1, a
#define CCP1IP                           BANKMASK(IPR3), 1, a
#define CCP1M0                           BANKMASK(CCP1CON), 0, a
#define CCP1M1                           BANKMASK(CCP1CON), 1, a
#define CCP1M2                           BANKMASK(CCP1CON), 2, a
#define CCP1M3                           BANKMASK(CCP1CON), 3, a
#define CCP1X                            BANKMASK(CCP1CON), 5, a
#define CCP1Y                            BANKMASK(CCP1CON), 4, a
#define CCP2                             BANKMASK(PORTC), 1, a
#define CCP2E                            BANKMASK(PORTE), 7, a
#define CCP2IE                           BANKMASK(PIE3), 2, a
#define CCP2IF                           BANKMASK(PIR3), 2, a
#define CCP2IP                           BANKMASK(IPR3), 2, a
#define CCP2M0                           BANKMASK(CCP2CON), 0, b
#define CCP2M1                           BANKMASK(CCP2CON), 1, b
#define CCP2M2                           BANKMASK(CCP2CON), 2, b
#define CCP2M3                           BANKMASK(CCP2CON), 3, b
#define CCP2X                            BANKMASK(CCP2CON), 5, b
#define CCP2Y                            BANKMASK(CCP2CON), 4, b
#define CCP2_PA2                         BANKMASK(PORTB), 3, a
#define CCP3M0                           BANKMASK(CCP3CON), 0, b
#define CCP3M1                           BANKMASK(CCP3CON), 1, b
#define CCP3M2                           BANKMASK(CCP3CON), 2, b
#define CCP3M3                           BANKMASK(CCP3CON), 3, b
#define CCP3X                            BANKMASK(CCP3CON), 5, b
#define CCP3Y                            BANKMASK(CCP3CON), 4, b
#define CCP4IE                           BANKMASK(PIE4), 1, a
#define CCP4IF                           BANKMASK(PIR4), 1, a
#define CCP4IP                           BANKMASK(IPR4), 1, a
#define CCP4M0                           BANKMASK(CCP4CON), 0, b
#define CCP4M1                           BANKMASK(CCP4CON), 1, b
#define CCP4M2                           BANKMASK(CCP4CON), 2, b
#define CCP4M3                           BANKMASK(CCP4CON), 3, b
#define CCP4MD                           BANKMASK(PMD0), 1, b
#define CCP4OD                           BANKMASK(ODCON2), 1, b
#define CCP4R0                           BANKMASK(RPINR32_33), 0, b
#define CCP4R1                           BANKMASK(RPINR32_33), 1, b
#define CCP4R2                           BANKMASK(RPINR32_33), 2, b
#define CCP4R3                           BANKMASK(RPINR32_33), 3, b
#define CCP4X                            BANKMASK(CCP4CON), 5, b
#define CCP4Y                            BANKMASK(CCP4CON), 4, b
#define CCP5IE                           BANKMASK(PIE4), 2, a
#define CCP5IF                           BANKMASK(PIR4), 2, a
#define CCP5IP                           BANKMASK(IPR4), 2, a
#define CCP5M0                           BANKMASK(CCP5CON), 0, b
#define CCP5M1                           BANKMASK(CCP5CON), 1, b
#define CCP5M2                           BANKMASK(CCP5CON), 2, b
#define CCP5M3                           BANKMASK(CCP5CON), 3, b
#define CCP5MD                           BANKMASK(PMD0), 2, b
#define CCP5OD                           BANKMASK(ODCON2), 2, b
#define CCP5R0                           BANKMASK(RPINR32_33), 4, b
#define CCP5R1                           BANKMASK(RPINR32_33), 5, b
#define CCP5R2                           BANKMASK(RPINR32_33), 6, b
#define CCP5R3                           BANKMASK(RPINR32_33), 7, b
#define CCP5X                            BANKMASK(CCP5CON), 5, b
#define CCP5Y                            BANKMASK(CCP5CON), 4, b
#define CCP6                             BANKMASK(PORTH), 7, a
#define CCP6E                            BANKMASK(PORTE), 6, a
#define CCP6IE                           BANKMASK(PIE4), 3, a
#define CCP6IF                           BANKMASK(PIR4), 3, a
#define CCP6IP                           BANKMASK(IPR4), 3, a
#define CCP6M0                           BANKMASK(CCP6CON), 0, b
#define CCP6M1                           BANKMASK(CCP6CON), 1, b
#define CCP6M2                           BANKMASK(CCP6CON), 2, b
#define CCP6M3                           BANKMASK(CCP6CON), 3, b
#define CCP6MD                           BANKMASK(PMD0), 3, b
#define CCP6OD                           BANKMASK(ODCON2), 3, b
#define CCP6R0                           BANKMASK(RPINR34_35), 0, b
#define CCP6R1                           BANKMASK(RPINR34_35), 1, b
#define CCP6R2                           BANKMASK(RPINR34_35), 2, b
#define CCP6R3                           BANKMASK(RPINR34_35), 3, b
#define CCP6X                            BANKMASK(CCP6CON), 5, b
#define CCP6Y                            BANKMASK(CCP6CON), 4, b
#define CCP7                             BANKMASK(PORTH), 6, a
#define CCP7E                            BANKMASK(PORTE), 5, a
#define CCP7IE                           BANKMASK(PIE4), 4, a
#define CCP7IF                           BANKMASK(PIR4), 4, a
#define CCP7IP                           BANKMASK(IPR4), 4, a
#define CCP7M0                           BANKMASK(CCP7CON), 0, b
#define CCP7M1                           BANKMASK(CCP7CON), 1, b
#define CCP7M2                           BANKMASK(CCP7CON), 2, b
#define CCP7M3                           BANKMASK(CCP7CON), 3, b
#define CCP7MD                           BANKMASK(PMD0), 4, b
#define CCP7OD                           BANKMASK(ODCON2), 4, b
#define CCP7R0                           BANKMASK(RPINR34_35), 4, b
#define CCP7R1                           BANKMASK(RPINR34_35), 5, b
#define CCP7R2                           BANKMASK(RPINR34_35), 6, b
#define CCP7R3                           BANKMASK(RPINR34_35), 7, b
#define CCP7X                            BANKMASK(CCP7CON), 5, b
#define CCP7Y                            BANKMASK(CCP7CON), 4, b
#define CCP8                             BANKMASK(PORTH), 5, a
#define CCP8E                            BANKMASK(PORTE), 4, a
#define CCP8IE                           BANKMASK(PIE4), 5, a
#define CCP8IF                           BANKMASK(PIR4), 5, a
#define CCP8IP                           BANKMASK(IPR4), 5, a
#define CCP8M0                           BANKMASK(CCP8CON), 0, b
#define CCP8M1                           BANKMASK(CCP8CON), 1, b
#define CCP8M2                           BANKMASK(CCP8CON), 2, b
#define CCP8M3                           BANKMASK(CCP8CON), 3, b
#define CCP8MD                           BANKMASK(PMD0), 5, b
#define CCP8OD                           BANKMASK(ODCON2), 5, b
